{
  "blogs": [
    {
      "id": "f89c",
      "title": "The 4 Things You Need for a Tech Bubble",
      "description": "On this episode of “Uncanny Valley,” guest Brian Merchant walks us through a historical framework he used to analyze whether AI fits the classic signs of an economic bubble—and what that means for all of us.",
      "body": "Chatter about an AI bubble has been everywhere lately, and top tech companies like Google, Meta, and Microsoft have doubled down on their AI investments for 2026. But how have analysts in the past accurately identified forming tech bubbles? Hosts Michael Calore and Lauren Goode sit down with Brian Merchant, WIRED contributor and author of the newsletter Blood in the Machine, to break down the four criteria some researchers have used in the past to understand and brace for the worst.\n\nArticles mentioned in the episode:\n\nPlease help us improve Uncanny Valley by filling out our listener survey.\n\nYou can follow Michael Calore on Bluesky at @snackfight and Lauren Goode on Bluesky at @laurengoode. Write to us at uncannyvalley@wired.com.\n\nHow to Listen\n\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\n\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts and search for “Uncanny Valley.” We’re on Spotify too.\n\nTranscript\n\nNote: This is an automated transcript, which may contain errors.\n\nMichael Calore: Hey Lauren, how are you doing?\n\nLauren Goode: I'm OK, Mike. It's earnings season, so a lot of us on the business desk here at WIRED have been tuning into tech companies earnings reports and their earnings calls. And I guess that basically means it's CapEx season.\n\nMichael Calore: CapEx?\n\nLauren Goode: Capital expenditures.\n\nMichael Calore: You say CapEx?\n\nLauren Goode: Yeah. Now that I'm a business desk reporter, I say CapEx.\n\nMichael Calore: You're one of those.\n\nLauren Goode: I throw it around at parties. No, I really don't. But we are seeing a trend in how tech companies are sleeping on piles of money, but they aren't just sleeping on it. They're sharing big plans to spend on it, and especially to spend on AI infrastructure.\n\nMichael Calore: Right. Data centers.\n\nLauren Goode: Yeah, more data centers. Not just data centers, but yes, that's a big part of it.",
      "category": "technology",
      "source": "Wired",
      "link": "https://www.wired.com/story/uncanny-valley-podcast-4-things-you-need-for-a-tech-bubble/",
      "date": "2025-11-17"
    },
    {
      "id": "584a",
      "title": "It’s not your job to fix the internet",
      "description": "The concept of enshittification, as coined by the author and activist Cory Doctorow, just feels right. Whether you're searching on Google, shopping on Amazon, or scrolling on Facebook, large platforms often feel like they're not trying to bring us value so mu…",
      "body": "The concept of enshittification, as coined by the author and activist Cory Doctorow, just feels right. Whether you’re searching on Google, shopping on Amazon, or scrolling on Facebook, large platforms often feel like they’re not trying to bring us value so much as extract every bit of value they can out of us. It wasn’t always like this, was it? Can we get it back?\n\nOn this episode of The Vergecast, Doctorow has an answer: no, it wasn’t always like this, and yes, we can get it back. Doctorow’s new book, Enshittification: Why Everything Suddenly Got Worse and What to Do About It, is filled with explanations about how large, successful, once user-focused products go wrong, and the ways in which regulators and competitors can make things better again.\n\nVerge subscribers, don’t forget you get exclusive access to ad-free Vergecast everywhere you get podcasts. Head here to get your ad-free feed. Not a subscriber? Sign up here.\n\nDoctorow was recently a guest on Decoder, explaining the nuts and bolts of the enshittification process. Here, we mostly tackle the question of what to do about it now. Doctorow’s work focuses largely on bigger-picture regulatory issues and technical changes, and his book largely advocates for changes at those levels. There’s no rousing speech in Enshittification about how users need to demand better, embrace friction, shop local, or get off Zuckerberg’s platforms.\n\nWhy not? Is there anything that we, the users of these products, who supposedly vote every day with our wallets and our attention spans, can do to push the internet back in the right direction?\n\nDoctorow has some answers, and some ideas. But he’s also quick to say that the way things are is not your fault. And fixing it is not your problem. (Unless you have the power to change bad laws — then it’s very much your fault and your problem.) The good internet is still out there, he says, and we have to go get it back.\n\nIf you want to know more about everything we discuss in this episode, here are some links to get you started:",
      "category": "technology",
      "source": "The Verge",
      "link": "https://www.theverge.com/podcast/822822/enshittification-cory-doctorow-interview-vergecast",
      "date": "2025-11-18"
    },
    {
      "id": "3be3",
      "title": "Two US marines implicated in killing family in notorious Iraq war shooting, expert tells BBC",
      "description": "New evidence raises doubts about the longest US war crimes investigation of the Iraq war and how US forces are held to account.",
      "body": "Two US marines implicated in killing family in notorious Iraq war shooting, expert tells BBC\n\n2 days ago Share Save Lara El Gibaly BBC Eye Investigations Share Save\n\nBBC Safa Younes is now 33 - she was the only person in her family to survive the shootings in Haditha\n\n\"This is the room where my whole family was killed,\" says Safa Younes. Bullet holes pepper the front door to the house in the Iraqi town of Haditha, where she grew up. Inside the back bedroom, a colourful bedspread covers the bed where her family was shot. This is where she hid with her five siblings, mum and aunt when US marines stormed into their home and opened fire, killing everyone apart from Safa, on 19 November 2005. Her dad was also shot dead when he opened the front door. Now, 20 years on, a BBC Eye investigation has uncovered evidence that implicates two marines, who were never brought to trial, in the killing of Safa's family, according to a forensic expert. The evidence - mainly statements and testimony given in the aftermath of the killings - raises doubts about the American investigation into what happened that day, and poses significant questions over how US armed forces are held to account. The killing of Safa's family was part of what became known as the Haditha massacre, when US marines killed 24 Iraqi civilians, including four women and six children. They entered three homes killing nearly everyone inside, as well as a driver and four students in a car, who were on their way to college. The incident triggered the longest US war crimes investigation of the Iraq war, but no-one was convicted of the killings.\n\nThe house in Haditha where Safa's family was killed in 2005\n\nThe marines said they were responding to gunfire after a roadside bomb went off, killing one of their squad members, and injuring two others. But Safa, who was 13 at the time, tells the World Service: \"We hadn't been accused of anything. We didn't even have any weapons in the house.\" She survived by pretending to be dead among the small bodies of her sisters and brother - the youngest was three years old. \"I was the only survivor out of my entire family,\" she says. Four marines were initially charged with murder, but they gave conflicting accounts of the events, and over time US military prosecutors dropped charges against three of them, granting them immunity from further legal action. That left squad leader Staff Sergeant Frank Wuterich as the only one to face trial in 2012.\n\nMichael Epstein In this image, taken from footage which has not been broadcast before, Humberto Mendoza (kneeling) demonstrates what happened\n\nIn a video recording of a pre-trial hearing, which has never been broadcast before, the most junior member of the squad, Lance Corporal Humberto Mendoza is questioned and re-enacts events at Safa's house. Mendoza - who was a private at the time and was never charged - admits to killing Safa's father when he opened the front door to the marines. \"Did you see his hands?\" a lawyer asks him. \"Yes sir,\" Mendoza responds, and goes on to confirm that Safa's father was not armed. \"But you shot him anyways?\" the lawyer asks. \"Yes sir,\" Mendoza says.\n\nOutside the UK, watch the film on YouTube. Viewers in the UK can see more on Global Eye at 19:00 on BBC Two\n\nIn his official statements, Mendoza had initially claimed that after entering the house, he opened the door to the bedroom where Safa and her family were, but when he saw there were only women and children inside he did not go in, and instead shut the door. However, in a newly discovered audio recording from Wuterich's trial, Mendoza gives a different account. He says that he walked about 8ft (2.4m) into the bedroom. This is hugely significant, according to forensic expert Michael Maloney. The Naval Criminal Investigative Service sent him to Haditha in 2006 to investigate the killings and he examined the bedroom where Safa's family was shot.\n\nSafa inside the bedroom where her family was killed, explaining where she lay pretending to be dead\n\nUsing the crime scene photos taken by the Marine Corps at the time of the killings, he concluded that two marines had entered the room and shot the women and children. When we played him the recording of Mendoza saying he had walked into the room, Maloney said: \"This is just amazing to me, what we're listening to, and I've never heard this before today.\" He said it showed Mendoza was placing himself in the position where Maloney concluded the first shooter stood, at the foot of the bed. \"If you were to ask me: 'Is this a confession of sorts?' What I'd say is: 'Mendoza confessed to everything except for pulling the trigger.'\" Safa had given a video deposition to military prosecutors in 2006 but it was never shown in court. In it, she described how the marine who opened the bedroom door threw in a grenade, which failed to explode, and then the same man came into the room and shot her family. Mendoza is the only marine who ever said he opened the door.\n\nUS Marine Corps Safa was 14 when she was filmed giving her testimony\n\nAnother marine, Lance Corporal Stephen Tatum did not deny he took part in the shootings, but said he had followed the squad leader, Wuterich, into the bedroom and initially claimed he did not know there were women and children there because of poor visibility. But in three later statements obtained by the BBC, Tatum gave a different account. \"I saw that children were in the room kneeling down. I don't remember the exact number but only that it was a lot. I am trained to shoot two shots to the chest and two shots to the head and I followed my training,\" Tatum told the Naval Criminal Investigative Service in April 2006. A month later, he said he \"was able to positively identify the people in the room as women and children before shooting them\". And then a week after that, he said: \"This is where I saw the kid I shot. Knowing it was a kid, I still shot him.\" He described the child as wearing a white T-shirt, standing on the bed, and having short hair. Tatum's defence lawyers claimed these later statements had been obtained under duress. Charges against Tatum were dropped in March 2008, and the statements were disregarded at Wuterich's trial. Forensics expert Michael Maloney said the statements by Mendoza and Tatum point to them being the two marines who shot Safa's family. He believes Mendoza went into the bedroom first and Tatum followed \"firing across the head of the bed\". We put the allegations to Mendoza and Tatum. Mendoza did not respond. He has previously admitted to shooting Safa's father, but said he was following orders. He was never charged with a criminal offence. Through his lawyer, Tatum said he wants to put Haditha behind him. He has never withdrawn his testimony that he was one of the shooters in Safa's house.\n\nMichael Epstein Squad leader, Frank Wuterich, was the only marine to stand trial for the deaths, but his charges were eventually dismissed in a plea deal\n\nMaloney told the BBC that the prosecution \"wanted Wuterich to be that primary shooter\". But before Maloney was able to testify, Wuterich's trial ended in a plea deal. Wuterich maintained he could not remember what had happened in Safa's house, and agreed to plead guilty to one count of negligent dereliction of duty - a charge unrelated to any direct involvement in the killings. Wuterich's military lawyer, Haytham Faraj, a former marine himself, said the punishment was \"tantamount to a slap on the wrist… like a speeding ticket\". Neal Puckett, the lead defence lawyer for Wuterich, said the whole investigation and prosecution against his client was \"botched\". \"The prosecution, in granting immunity to all their witnesses and dismissing all their charges… essentially rendered themselves incapable of achieving justice in this case,\" he said. Haytham Faraj agreed the process was deeply flawed. \"The government paid people to come in and lie, and the payment was immunity, and that's how they misused the legal process,\" he told the BBC. \"The trial of Haditha was never meant to give voice to the victims,\" he added. He said that survivors' \"impressions of a show trial with no real outcome, with no-one being punished, was right\".\n\nSafa still lives in Haditha and now has a daughter and two sons",
      "category": "technology",
      "source": "BBC News",
      "link": "https://www.bbc.com/news/articles/c2emyz0zpxko",
      "date": "2025-11-17"
    },
    {
      "id": "c835",
      "title": "WIRED Roundup: Fandom in Politics, Zuckerberg’s Illegal School, and Nepal’s Discord Revolution",
      "description": "In this episode of “Uncanny Valley,” we run through the top stories of the week and examine how some of the victories in the US November elections show the power of online fandom.",
      "body": "In today’s episode, host Zoë Schiffer is joined by senior politics editor Leah Feiger to discuss the top stories you need to know about this week—from Mark Zuckerberg’s illegal school to the repercussions behind the recent pardoning of Changpeng Zhao, Binance’s ex-CEO. Then, Zoë and Leah discuss how fandom on the internet played a key role in this year’s US election results.\n\nArticles mentioned in this episode:\n\nPlease help us improve Uncanny Valley by filling out our listener survey.\n\nYou can follow Zoë Schiffer on Bluesky at @zoeschiffer and Leah Feiger on Bluesky at @leahfeiger. Write to us at uncannyvalley@wired.com.\n\nHow to Listen\n\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\n\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts and search for “Uncanny V+alley.” We’re on Spotify too.\n\nTranscript\n\nNote: This is an automated transcript, which may contain errors.\n\nZoë Schiffer: Welcome to WIRED's Uncanny Valley. I'm WIRED's director of business and industry, Zoë Schiffer. Today on the show, we're bringing you the top stories that you need to know about this week, including how the Democrats fared much better than anyone expected in this week's elections, and how some of those victories show the power of online fandom. I'm joined today by our senior politics editor, Leah Feiger.\n\nLeah Feiger: Hey, Zoë. Great to be here.\n\nZoë Schiffer: Leah, our first story this week is one that will really make your head spin, and it's about how Mark Zuckerberg opened an illegal school at his Palo Alto compound.",
      "category": "politics",
      "source": "Wired",
      "link": "https://www.wired.com/story/uncanny-valley-podcast-wired-roundup-fandom-politics-zuckerberg-illegal-school-nepal-discord-revolution/",
      "date": "2025-11-17"
    },
    {
      "id": "a449",
      "title": "'Things happen' - Trump defends Saudi crown prince over Khashoggi killing",
      "description": "The US president's claims that the crown prince \"knew nothing\" contradict the CIA's own assessment.",
      "body": "'Things happen' - Trump defends Saudi crown prince over Khashoggi killing\n\nWatch: Trump says Saudi crown prince \"knew nothing\" about Jamal Khashoggi's murder\n\nIt was his first US visit since the assassination, which sent shockwaves through the US-Saudi relationship.\n\nThe crown prince, who has denied any wrongdoing, said at the White House that Saudi Arabia \"did all the right things\" to investigate Khashoggi's death, which he called \"painful\".\n\nTrump's comments appeared to contradict a US intelligence assessment in 2021 which determined the crown prince had approved the operation that led to Khashoggi's death at the Saudi consulate in Istanbul in 2018.\n\nUS President Donald Trump said Saudi Crown Prince Mohammed bin Salman \"knew nothing\" about the 2018 killing of journalist Jamal Khashoggi, as he welcomed the kingdom's de facto ruler to the White House.\n\nIn the Oval Office on Tuesday, Trump shot back at a reporter who asked a question about the killing.\n\n\"You're mentioning someone that was extremely controversial,\" the US president said.\n\n\"A lot of people didn't like that gentleman that you're talking about. Whether you like him or didn't like him, things happen.\"\n\n\"But he [the Crown Prince] knew nothing about it,\" Trump added. \"You don't have to embarrass our guests.\"\n\nThe crown prince added that Saudi Arabia \"did all the right steps\" to investigate the murder, which he called \"painful\" and a \"huge mistake\".\n\nA US intelligence report made public in 2021 - under President Joe Biden's administration - determined that the crown prince had approved of a plan to \"capture or kill\" Khashoggi in Istanbul. During his first administration, Trump White House officials declined to release the report.\n\nWhile dozens of Saudi officials faced sanctions in the wake of the assassination, none directly targeted the crown prince.\n\nAt the time, Saudi Arabia rejected the report as \"negative, false and unacceptable\".\n\nOn Tuesday, Khashoggi's widow called on the crown prince to apologise for her husband's murder, for which she said there was \"no justification\".\n\n\"The Crown Prince said he was sorry so he should meet me, apologize and compensate me for the murder of my husband @JKhashoggi,\" Hanan Elatr Khashoggi posted on X. Granted political asylum in the US, she lives in the Washington DC area.\n\nTuesday's meeting between Trump and Mohammed bin Salman was expected to include deals on civilian nuclear power, artificial intelligence and Saudi investment in the US, which the crown prince said was being upped to $1tr (£761bn) from $600bn pledged earlier this year.\n\nEchoing Trump's own words, bin Salman said that the US was the \"hottest country on the planet\" and praised the US president for creating \"long-term opportunity\".\n\nThe two men also discussed the potential sale of advanced F-35 fighter aircraft to the Saudis.\n\nTrump said that while export licences were still being announced, he expected a deal between the Saudis and US defence giant Lockheed Martin.\n\nThe potential sale has caused alarm among some Israeli officials, who have said that it could potentially hurt the country's \"qualitative military edge\" in the Middle East, where it is so far the only nation to have F-35s.\n\nThe US president said the model sold to the Saudis would be broadly similar to the one the Israelis operate.\n\n\"This [Saudi Arabia] is a great ally, and Israel is a great ally,\" Trump said. \"I know they'd like you to get planes of reduced calibre.\n\n\"But as far as I'm concerned, I think they are both at a level where they should get top of the line,\" he added.\n\nThe crown prince's visit to Washington continues with a gala dinner on Tuesday night, followed by an investment summit on Wednesday.\n\nPortuguese footballer Cristiano Ronaldo - who plays in the Saudi professional league - was also expected to be at the White House on Tuesday, a White House official confirmed to the BBC.\n\nBiden did not host the crown prince and vowed to make Saudi Arabia a \"pariah\" over its human rights record. In 2022, however, Biden visited the kingdom to reach agreement on other issues.",
      "category": "politics",
      "source": "BBC News",
      "link": "https://www.bbc.com/news/articles/cn0gdkwp2p9o",
      "date": "2025-11-18"
    },
    {
      "id": "0b47",
      "title": "Ecuador votes against allowing foreign military bases in country",
      "description": "Voters have rejected a referendum proposal, dealing a blow to President Daniel Noboa and US ambitions in the region.",
      "body": "Ecuador votes against allowing foreign military bases in country\n\nThe US had hoped the referendum would pave the way to opening a military base in Ecuador, 16 years after it was made to close a site on its Pacific coast.\n\nHe had said it would help fight organised crime and reduce the soaring violence the country has seen in recent years, during which it has become one of the world's biggest drug-trafficking hotspots.\n\nThe referendum result is a blow to Ecuador's President Daniel Noboa, who had campaigned to change the constitution to reverse a ban that the country's legislature passed in 2008.\n\nEcuadoreans have voted against allowing the return of foreign military bases in the country, frustrating US hopes of expanding its presence in the eastern Pacific region.\n\nWhile Ecuador does not produce cocaine, its huge ports and proximity to Colombia and Peru - where large quantities of the drug are made - make it a desirable and lucrative location for drug-trafficking gangs.\n\nAbout 70% of the world's cocaine passes through Ecuador, according to Noboa.\n\nHis presidency has been defined by a tough military crackdown on criminal gangs, including by putting armed soldiers on the streets.\n\nSupporters say his approach has helped to fight crime, but critics say his government has resorted to authoritarian tactics.\n\nThe former US military base on Ecuador's Pacific coast was closed after left-wing President Rafael Correa decided not to renew its lease and pushed for the constitutional ban.\n\nUS Homeland Secretary Secretary Kristi Noem recently toured military facilities in Ecuador with Noboa.\n\nNoboa told the BBC earlier this year that he wanted foreign \"armies\" to join what he has described as a \"war\" against narco-trafficking groups. He has recently held talks over increased regional security and migration co-operation with US officials.\n\nThe referendum also saw voters reject ending public funding for political parties, shrinking the size of Congress, and establishing a constitutional assembly to re-write Ecuador's constitution.\n\nNoboa had argued a fresh constitution would allow for tougher punishments for criminals and stronger measures to secure the borders, but critics argued it would not solve wider social problems like insecurity and poor access to education or healthcare in some areas.\n\nCritics also feared the plans to reduce funding for political parties and the size of Congress could lead to a reduction in checks and balances on the government and representation in poorer areas, though the government hoped it would save public funds.\n\nNoboa reacted by saying he would \"respect\" the outcome of the vote.\n\nOn the day of the referendum, the leader of one of Ecuador's biggest drug-trafficking gangs, Los Lobos, was captured in an operation involving Spanish police.\n\nWilmer \"Pipo\" Chavarria had faked his own death and had been hiding in Europe while controlling criminal operations like drug-trafficking, ordering murders and illegal mining in Ecuador, Noboa said.\n\nBoth Ecuador and the US have designated Los Lobos as a terrorist organisation under domestic law.\n\nThis referendum came as the US sent its largest military deployment to the Caribbean in decades, including the world's largest warship and bomber planes.\n\nIt has carried out at least 21 strikes on alleged drug-trafficking vessels in the eastern Pacific and the Caribbean, killing at least 83 people. It has not provided evidence about who was aboard and some lawyers have said the strikes may breach international law.\n\nSpeculation is mounting over whether the US will strike land targets in Venezuela.\n\nThe US alleges that its President Nicolás Maduro is the head of a narco-trafficking organisation, an accusation he strongly denies.\n\nMany observers believe the US military build-up in the region is also an attempt to put pressure on Maduro to force him from power.",
      "category": "politics",
      "source": "BBC News",
      "link": "https://www.bbc.com/news/articles/c891zkwvjl2o",
      "date": "2025-11-17"
    },
    {
      "id": "1455",
      "title": "Meta is not a monopolist, judge rules",
      "description": "Meta won a landmark antitrust battle with the Federal Trade Commission on Tuesday after a federal judge ruled it has not monopolized the social media market at the center of the case. US District Court Judge James Boasberg wrote that Meta had not unfairly cor…",
      "body": "is a senior policy reporter at The Verge, covering the intersection of Silicon Valley and Capitol Hill. She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\n\nMeta won a landmark antitrust battle with the Federal Trade Commission on Tuesday after a federal judge ruled it has not monopolized the social media market at the center of the case.\n\nUS District Court Judge James Boasberg wrote that Meta had not unfairly cornered a market on “personal social networking,” a category that includes a narrow subset of social media apps including Facebook, Instagram, and Snapchat. The decision, which can be appealed by the FTC, means Meta will not immediately face demands to undo acquisitions of Instagram and WhatsApp.\n\nBoasberg noted that he’d warned the FTC that it faced an “uphill battle” in defining the market at issue and proving Meta held an illegal monopoly in it. Ultimately, he ruled, it failed to prove that Meta didn’t face substantial competition from other kinds of social media platforms, particularly after the rapid rise of TikTok — which Meta cited as a major factor in its defense. “The landscape that existed only five years ago when the Federal Trade Commission brought this antitrust suit has changed markedly,” Boasberg wrote. “While it once might have made sense to partition apps into separate markets of social networking and social media, that wall has since broken down.”\n\nThe FTC argued that Meta had maintained illegal monopoly power in the narrow sector of the social media market by gobbling up nascent competitors, Instagram and WhatsApp, it feared could threaten its dominance. But throughout the trial, the FTC was dogged by questions about whether it could claim Meta still had that illegal monopoly in the face of a greatly changed social media landscape. Boasberg said the government had to prove current or imminent illegal monopolization, not just past dominance.\n\n“With apps surging and receding, chasing one craze and moving on from others, and adding new features with each passing year, the FTC has understandably struggled to fix the boundaries of Meta’s product market,” Boasberg wrote. “Even so, it continues to insist that Meta competes with the same old rivals it has for the last decade, that the company holds a monopoly among that small set, and that it maintained that monopoly through anticompetitive acquisitions. Whether or not Meta enjoyed monopoly power in the past, though, the agency must show that it continues to hold such power now. The Court’s verdict today determines that the FTC has not done so.”\n\nThe FTC “continues to insist that Meta competes with the same old rivals it has for the last decade”\n\nThough the FTC tried to prove throughout trial that social media users come to Meta’s apps for different use cases of connecting with friends than they do video and broadcast-focused apps like YouTube or TikTok, Boasberg seemed unconvinced. “Meta’s apps are reasonably interchangeable with TikTok and YouTube,” he wrote. One compelling piece of evidence was how users flocked to Meta’s apps during TikTok’s brief blackout in the US around its short-lived ban. Boasberg said the way users would substitute Meta’s apps for TikTok showed that “the FTC’s hypothesis about how people use these apps is consistently disproven by the data.”\n\nStill, Boasberg conceded that YouTube’s inclusion in the personal social networking market is “more debatable” than TikTok’s. That goes to show how much of a role the timing in the case might have played in the outcome — now, Boasberg wrote, Meta would still not hold monopoly power with TikTok in the picture, even if he believed YouTube was not an appropriate substitute.\n\nBoasberg had plenty of opportunities to block the case from going to trial, including when he initially threw out the FTC’s case, but gave it a chance to refile. Every time he has reexamined Meta’s apps throughout the years of litigation, he wrote, both Meta’s apps and its competitors had changed. “The Court’s two Opinions on motions to dismiss did not even mention the word ‘TikTok,’” Boasberg wrote. “Today, that app holds center stage as Meta’s fiercest rival.”\n\n“The Court’s decision today recognizes that Meta faces fierce competition,” Meta spokesperson Jennifer Newstead said in a statement. “Our products are beneficial for people and businesses and exemplify American innovation and economic growth. We look forward to continuing to partner with the Administration and to invest in America.” FTC spokesperson Joe Simonson said the agency was “deeply disappointed” in the ruling. “The deck was always stacked against us with Judge Boasberg, who is currently facing articles of impeachment. We are reviewing all our options.” GOP lawmakers have filed articles of impeachment over Boasberg’s separate rulings about the Trump administration’s invocation of the Alien Enemies Act, and Special Counsel Jack Smith’s investigation into the 2020 election.\n\nThe ruling represents a second significant antitrust loss for the FTC against Meta. During the Biden administration, a court let Meta complete its acquisition of virtual reality fitness startup Within despite an FTC challenge, and the agency ultimately decided not to appeal. The FTC’s monopolization case against Meta was first filed during the first Trump administration, and the amended complaint was filed during the Biden administration. The case went to trial earlier this year during the second Trump administration.\n\nThe government now has a mixed record in its modern tech monopoly cases. The Justice Department won both of its monopolization cases against Google’s search and ad tech businesses, though a judge failed to deliver most of the remedies it wanted in the search case. Closing arguments in the remedies phase of the ad tech case are scheduled for later this week.",
      "category": "economy",
      "source": "The Verge",
      "link": "https://www.theverge.com/news/823191/meta-ftc-antitrust-trial-ruling",
      "date": "2025-11-18"
    },
    {
      "id": "2194",
      "title": "The Apple Watch Series 11 has plunged to a record low price",
      "description": "The latest Apple Watch SE impressed us with all of its upgrades this year, but the Apple Watch Series 11 is still the better option if you’re an iPhone owner who requires more advanced health notifications. Thankfully it, like the SE, is now down to a new re…",
      "body": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nThe latest Apple Watch SE impressed us with all of its upgrades this year, but the Apple Watch Series 11 is still the better option if you’re an iPhone owner who requires more advanced health notifications. Thankfully it, like the SE, is now down to a new record-low price, starting at $349.99 ($50 off) at Amazon and Walmart for the 40mm, GPS-enabled version.\n\nUnlike the SE 3, Apple’s entry-level wearable, the Apple Watch Series 11 offers features like EKG readings, blood oxygen tracking, and the FDA-cleared hypertension notifications. Its 24-hour battery life makes it far more useful for sleep tracking, and it won’t drain nearly as quickly if you opt for the new 5G-enabled cellular model. It also features a larger display with thinner bezels, which is especially helpful for older users or anyone who doesn’t want to strain their eyes.\n\nThe Apple Watch Series 11 comes loaded with other helpful features. Like the Apple Watch SE 3, it includes sleep-apnea notifications, a wrist-temperature sensor, fall detection, and ovulation tracking. It also supports wrist-flick and double-tap gestures, so you can quickly clear notifications or answer phone calls hands-free without tapping the screen.\n\nSome more ways to save\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
      "category": "technology",
      "source": "The Verge",
      "link": "https://www.theverge.com/tech/823052/apple-watch-series-11-onn-4k-pro-deal-sale",
      "date": "2025-11-18"
    },
    {
      "id": "6d86",
      "title": "Modern-Day Snake Oil: How Wellness Influencers Gained the Power to Spread Health Misinformation",
      "description": "We're all susceptible to believing health misinformation, and wellness influencers know exactly how to reel us in.",
      "body": "At the age of 18, I graduated from the pediatrician I'd seen since birth and entered the world of adult health care. It was the last time I had a consistent primary care doctor.\n\nI still get a physical every year, but it's usually with a new doctor each time, depending on multiple factors: my location, my insurance and which office answers the phone — usually after a few calls and never-ending hold music. Timely appointments are tough to come by, so if I need immediate attention, I'll head to an urgent care and prepare for what could be an hours-long wait.\n\nWhen I finally do get to see a doctor, it's often a cold, clinical experience in a white cube of a room with a physician who's a stranger and knows nothing about my medical history.\n\nCompare that to videos from wellness influencers effortlessly floating across your phone screen, making longevity, happiness, less bloating, glowing skin, peak fitness, long hair and a strong immune system seem as easy as taking a supplement with your lemon water.\n\nAnswers to our pressing medical questions have never been so convenient and alluring.\n\nI'm sure many people can relate to the struggle of finding quality health care information and providers. According to a 2023 study by the National Association of Community Health Centers and American Academy of Family Physicians, over 100 million Americans, about one-third of the population, face barriers to accessing primary care. Even more alarming, this number has almost doubled since 2014.\n\nDr. Mike Varshavski, known as \"Doctor Mike,\" is a board-certified family medicine physician with over 29 million social media followers. He says multiple factors have contributed to health care's inability to provide people the answers they seek. These include solo practice family medicine physician offices closing or being bought out, fallen reimbursement rates by insurance companies and the administrative burden facing family medicine physicians. Family medicine is one of the lowest-paying specialties, making students less inclined to pursue it.\n\nThe obstacles to access primary care also loom larger for women and BIPOC communities, particularly Black women, who are more likely to experience medical gaslighting, making them less likely to trust a doctor in the future.\n\nTrust is a significant difficulty when accessing health care.\n\n\"Survey data indicates that trust in institutionalized expertise has been in decline in the US since the 1950s,\" says Stephanie Alice Baker, associate professor of sociology at City St George's, University of London. \"Throughout the late 20th century, a series of scandals involving the pharmaceutical and food industries has sown distrust about the financial and political motives of scientific and medical institutions.\"\n\nThis distrust was further cemented during the COVID-19 pandemic. According to the Pew Research Center, confidence in scientists acting in the public's best interests dipped by 14% between April 2020 and fall 2023.\n\nYet right within our grasp, tens of millions of videos on platforms like TikTok, YouTube, Facebook and Instagram feature people whose lives have allegedly been improved by a wellness ritual or product. Collectively, they promote all aspects of wellness, a multitrillion-dollar industry that encompasses mental wellness, healthy eating, physical activity, wellness tourism, weight loss, homeopathic and naturopathic alternative medicine, personal care, beauty and more.\n\nBut these videos don't always have your best interests in mind. There's a wide spectrum of creators and motivations, ranging from medical professionals who may have corporate sponsorships or be promoting their own products, to those with dubious intentions: influencers with little or no medical training who accept gifts or run ads for the companies whose products they're promoting. They could also be pushing their own products first and actual wellness second.\n\nThe Federal Trade Commission requires that any relationship between an influencer and a brand be disclosed in a manner that viewers can see and understand, such as with #ad or #sponsored. Yet, regardless of the disclosures, these wellness videos give the impression that every aspect of your health is in your control.\n\n\"What wellness influencers do very well is make it seem like if you do X, you will be healthier,\" says Jessica B. Steier, who holds a doctorate in public health, is the founder and host of Unbiased Science and executive director of the Science Literacy Lab. \"It makes people feel like they have a ton of control over their health, and that's empowering.\"\n\nIt's no wonder we get drawn in, lured down the rabbit hole into a trap of misinformation if the influencer doesn't have their facts straight -- or worse, is intentionally misleading us.\n\nWellness influencers have the ability to spread misinformation across the internet, but the effects don't end on social media. Getty Image/ Zooey Liao/ CNET\n\nWhen misinformation spreads like a virus\n\nAs a journalist who's covered health, wellness and lifestyle for the past 11 years, I've reported on countless wellness trends. What I've learned from the doctors I've interviewed is that what's most important isn't the trend of the moment, but the basic tenets of a healthy lifestyle, such as a balanced diet, exercise, sleep, stress management and community. But these aren't the magic bullets that make wellness trends so marketable.\n\nWhile overcoming the obstacles to accessing a primary care doctor can be frustrating, it's essential to have a medical expert you can trust, so you don't end up relying on information from uncredentialed influencers promoting the latest wellness trends for their own benefit and possibly putting your health at risk.\n\nI asked Brian Southwell, a distinguished fellow and lead scientist for public understanding of science at RTI International and an adjunct professor of internal medicine with Duke University, how he would define misinformation. He points me to a definition he worked on in a 2025 consensus study with the National Academies of Sciences, Engineering and Medicine:\n\n\"Misinformation about science is information that asserts or implies claims that are inconsistent with the weight of accepted scientific evidence at the time (reflecting both quality and quantity of evidence).\"\n\nOne infamous source of health care misinformation online was Belle Gibson, an Australian wellness influencer whose story inspired the Apple Cider Vinegar series on Netflix. In 2013, at age 22, she lied about having terminal brain and other cancers to her Instagram followers, claiming that instead of treating her supposed illnesses with chemotherapy and radiation, she was healing herself naturally with a healthy diet. From there she launched her wellness app, The Whole Pantry, and a cookbook, earning half a million dollars in less than two years.\n\nFitness influencer Brian Johnson is also known as Liver King on TikTok, Instagram and YouTube. In 2021 he promoted that consuming raw animal organs, performing fitness challenges, getting back to an \"ancestral\" lifestyle and, naturally, consuming supplements from his brand with a $100 million annual turnover could give his followers a muscular body like his own. In 2022, leaked emails revealed that the then-43-year-old had been injecting himself with performance and image-enhancing drugs like steroids and human growth hormone.\n\nThe lifestyles that influencers encourage have even resulted in death. Paloma Shemirani died at age 23 from a heart attack caused by an untreated tumor after refusing chemotherapy in favor of an alternative cancer treatment called Gerson therapy — coffee enemas, supplements and a plant-based diet with raw juices — as recommended by her mother, Kate Shemirani, a conspiracy theorist and known anti-vaccine influencer.\n\nThere have also been anti-vaccine influencers who died because of COVID-19. There was Dmitriy Stuzhuk in 2020, who told his followers that COVID-19 wasn't real, and Cirsten Weldon in 2022, who spread misinformation and conspiracy theories about the illness.\n\nKnowing who to trust in the world of wellness has become even more complicated with Robert F. Kennedy Jr.'s appointment as the US Secretary of Health and Human Services. RFK Jr. is not a medical doctor and has no background in medicine. He also surrounds himself with wellness influencers who promote the Make America Healthy Again agenda.\n\nWhy might people trust wellness influencers more than their own doctor? When I asked Dr. Garth Graham, cardiologist, researcher, public health expert and director and global head of health care and public health partnerships at YouTube and Google Health, he referenced the 2025 Edelman Trust Barometer Special Report: Trust and Health.\n\nThe report, which included over 16,000 participants across 16 countries, found that people consider someone a legitimate health expert not only when they have academic training, but also when they have personal experience with health issues.\n\n\"People trust information from people who are similar to them or at least can empathize with their own cultural or personal experiences, so that opens the room for a diversity of voices to be able to contribute to that,\" says Graham.\n\nTrust in health care has become a problem, leaving patients to turn to the internet. 2025 Edelman Trust Barometer Special Report: Trust and Health/ Getty Images/ Zooey Liao\n\nAmong the 73% of Edelman report participants who see a clinician regularly, 53% feel that their doctor is \"slightly or not qualified\" to care for all their health problems, including physical, mental, social and environmental issues. If their doctor can't address an issue, 65% of these people said they turn to non-institutional sources like friends and family, online searches and social media.\n\nThough it may seem like it, keep in mind that not everything on social media is misinformation.\n\n\"Headlines might sometimes suggest that we're totally inundated with misinformation, and I'm not sure that's an accurate statement,\" Southwell says. \"I think that there is a lot of information that we don't necessarily pay attention to, but that is accurate and useful.\"\n\nYour likelihood of encountering misinformation becomes a problem when you consider that, according to a 2025 health information and trust tracking poll conducted by nonprofit information organization KFF, which included 1,283 US adults, 55% of adults say they use social media to access health information and advice, at least occasionally. This includes larger shares of young adults and Black and Latinx adults.\n\nEdelman reports that young people aged 18 to 34 were twice as likely to listen to uncredentialed advice as adults over 55. At least once, 58% of people in this age group said they regretted a health decision they made based on misinformation.\n\nThe tricks and tech of the wellness trade\n\nWe all gravitate toward trusting people with shared experiences. But on social media, there are additional factors that lure us in. As many seek out health information that will heal us and reverse the clock on aging, ironically, what it often comes down to is time.\n\n\"People spend about 2 hours a day on their phones on social media … They see influencers. I'm a physician and I'm online, so they'll see me too, but they'll see these people who look approachable and relatable,\" says practicing pediatric allergist and clinical immunologist Dr. Zachary Rubin, a medical educator on social media with close to 4 million followers. \"They start to develop this parasocial relationship where they think they actually know this person when, really, they don't.\"\n\nAfter all, you might listen for hours to an influencer you follow online, compared with only 15 minutes with your own doctor.\n\nWellness influencers speak with authority and confidence, provide easy solutions to complex problems and oversimplify nuanced information. Baker wrote about this in her 2019 book Lifestyle Gurus.\n\n\"The three A's (the impression of authenticity, accessibility and autonomy) are central to how influencers establish trust and intimacy with their followers,\" Baker says.\n\n\"One thing I am very confident in is ... nobody particularly wants to get misinformation when they're looking for answers.\" Brian Southwell, distinguished fellow, RTI International lead scientist for public understanding of science\n\nInfluencers also make it seem like they're on the same level as you, says Mariah L. Wellman, assistant professor in the College of Communication at Michigan State University, who is writing the book In Search of Wellness: Social Media Influencers and the Transformation of an Industry. The power dynamics in a patient-doctor relationship aren't there with wellness influencers.\n\nThis makes it much easier for wellness influencers to develop relationships with their followers. They have the time to do so compared to doctors who see patients all day for only short pockets of time. Posting a video that lacks research and evidence also doesn't take up as many hours as researching and providing evidence-based information.\n\nA network of credentialed health care influencers called Fides was created in 2020 during the height of the COVID-19 pandemic by Andrew Pattison, team lead of digital channels in the Department of Digital Health and Innovation at the World Health Organization.\n\nFides — which comes from the phrase \"bona fide,\" meaning \"in or with good faith\" in Latin, and is also the name of the Roman goddess of trust, faithfulness and good faith — aims to create quality health content that counteracts health misinformation with evidence-based information.\n\n\"To create misinformation takes minutes. To debunk misinformation sometimes takes weeks,\" Pattison says. \"To create good health content takes time, effort, knowledge and research, whereas to create health misinformation, you can do it in 5 minutes and all you need is a phone.\"\n\nWellness influencers also know how to use technology to their advantage. \"These influencers that I follow are utilizing every part of the apps possible to push their narrative and sell their products,\" says Mallory DeMille, a correspondent for the Conspirituality podcast and a social media creator who uses her background in marketing, communications and social media to post videos that call out problematic wellness influencers.\n\nConsider the influencers you see using TikTok Shop to promote wellness products. According to Capital One Shopping's research, about 79% of US TikTok Shop products are in the health and beauty category.\n\nThose products are supposed to be bound by TikTok Shop rules that prohibit promoting content if it includes medical claims, exaggerated promises, weight management products, phrases or implications about treating or preventing any disease or claims that imply certain products have pharmacological, immunological or metabolic effects.\n\nI put this to the test by searching for \"weight supplements\" on TikTok Shop. I came across Kourtney Kardashian's \"Lemme Burn\" (which I now receive constant ads for in my feed). When I click on the product, a video voiceover tells me that since the creator started taking the supplement, they no longer have a sweet tooth and have become a whole new person three months postpartum. Text over the video says \"summer body coming right up.\"\n\nWhen I click on the account, @mbti.dose, it's obvious that it's not a real person. There are countless videos with hands holding various products and different voices encouraging you to buy them.\n\nThe TikTok Shop description says Lemme Burn is scientifically formulated to activate metabolism and support healthy body composition, with the disclaimer that it's best used alongside healthy eating and exercise. According to its website, the supplement helps \"fight belly fat.\"\n\nIs this not a weight management product claiming to have metabolic effects?\n\nWhen I asked TikTok about that, a spokesperson merely pointed to the company's community guidelines and TikTok Shop policies, saying that if prohibited content is found, it will be removed.\n\nMeanwhile, the FDA lacks the authority to approve supplements before they're sold to the public.\n\n\"They start to develop this parasocial relationship where they think they actually know this person when, really, they don't.\" Dr. Zachary Rubin, pediatric allergist and clinical immunologist\n\nWhether promoting products or sharing their opinions and experiences, influencers have the time to use the tech at their fingertips to create content that's as engaging as possible. They're running laps around health care professionals who are doing their research and exercising caution as they fight misinformation with their own videos.\n\n\"[The person spreading misinformation], generally, is thinking, 'I'm going to use cool transitions. I'm going to use hooks. I understand what a hook is. I'm going to use emotions that will get people excited, scared or worried … and cool music and cool trends,'\" says Pattison. \"Anything that makes you excited is going to be engaged content, whether it's fear or excitement.\"\n\nUltimately, wellness influencers give their viewers a sense of control and create an emotional response. According to Steier, the COVID-19 pandemic compounded this. Along with epidemiologist and data scientist Kaitlyn Jetelina of Your Local Epidemiologist, Steier co-founded The Evidence Collective of science communicators to combat misinformation online.\n\n\"I think that the pandemic changed everything,\" Steier says. \"I think it made a lot of us face our own mortality and think about our health and how we're living our lives.\"\n\nMedicine meets media\n\nFides is using wellness influencers' tried-and-true tech tools to its own advantage. The network comprises over 1,200 health care professionals split into two groups: people who already have experience, good content and a large following, and those who Fides wants to help build capacity in the health care workforce.\n\nFides offers creators the latest health information, content and assets to make their lives easier, as well as a space where they can share their videos with one another for feedback. The WHO team also plans campaigns so that its members are posting on the same topic, at the same time, thus increasing their reach and impact.\n\nThe World Health Organization is working to combat health misinformation with its Fides network. Getty Images/Zooey Liao/CNET\n\nTraining courses are offered regularly, some of which are facilitated by tech companies like YouTube, Instagram, TikTok and LinkedIn, and focus on topics such as safety tools, finding time to create content, trending topics and handling online trolls.\n\nPattison emphasizes that these health care professionals are not ambassadors for WHO and that Fides' aim isn't to promote the organization. They simply want to advance public health and provide the Fides community with the information and tools needed to do so. Members can say they're part of Fides if they want, but they're not obligated to, and there's no publicly available list of members for data protection reasons.\n\n\"The idea is to create a movement similar to the antivax movement, which is small but very powerful, well coordinated and well funded,\" says Pattison. \"They have a targeted approach where they flood the market with one message and then by the time public health responds to that, the public has moved on and they're flooding it with another message.\"\n\nIn 2021, the Center for Countering Digital Hate found that 12 anti-vaxxers, also known as the \"disinformation dozen,\" were responsible for up to 65% of anti-vaccine content on Facebook and Twitter. This was after analyzing 812,000 posts on the platforms between February and March 2021.\n\nIn other words, the misinformation spread by just a few people can have a substantial impact.\n\nFides isn't the only example of health care professionals saying, \"If you can't beat 'em, join 'em,\" regarding the tech tactics wellness influencers use to tempt us. After noticing that his patients and loved ones were turning to the internet with their medical questions, Varshavski realized there were no great sources available to them.\n\n\"[Doctors on social media] were very clinical and scientific, which is good because it was accurate, but it wasn't captivating,\" says Varshavski. \"What was captivating was all the people trying to sell the miracle products, snake oil-type products, people who were trying to build a name for themselves by attacking the status quo.\"\n\n\"Influencers ... are utilizing every part of the apps possible to push their narrative and sell their products.\" Mallory DeMille, Conspirituality podcast correspondent\n\nVarshavski then took what he saw these snake oil salespeople doing, but instead of using those tactics to sell products, he applied them to spread high-quality health information.\n\n\"I realized that they're great speakers, that they understood the platforms well,\" says Varshavski. \"Titling, thumbnailing and being comedic, self-deprecating and entertaining needed to come first in order for the medical information to land.\"\n\nRubin has come to a similar conclusion since moving over to TikTok from Twitter in 2021. Social media algorithms are designed to keep people on their phones for as long as possible to drive advertising dollars, and Rubin found that content evoking an emotional response is more likely to get pushed to the top of people's feeds by algorithms, as opposed to more nuanced, scientifically sound information that could get written off as boring.\n\n\"That's why I utilize certain tactics to try to get myself higher up on the algorithm, like having a hook, often a weird one. I often say 'holy cow, folks,' which is something that, when you hear it enough, you're like, 'Oh wait, I know that's Dr. Rubin. He's about to talk about something important,'\" Rubin says. \"Those are signals that I know will at least trip the algorithm enough when I think it's important.\"\n\nWhen followers pay the price — literally\n\nWatching wellness influencers' videos online can spark the chain reaction leading to health anxiety, potentially unnecessary doctors' appointments, tests and overdiagnosis.\n\nA February 2025 study led by the University of Sydney focused on about 1,000 Instagram and TikTok posts highlighting five popular medical tests: full-body MRIs (notably promoted by Kim Kardashian); the multicancer early detection genetic test; and tests for antimullerian hormone for women's egg counts, the gut microbiome and testosterone, respectively. These posts reached around 200 million followers.\n\n\"We found that around 70% of the people talking about these medical tests that had no evidence of benefit, they had a direct financial interest, and we know that's probably an underestimation because we were only looking for explicit [cases of financial interest] and often they're hidden,\" says Brooke Nickel, one of the study's authors, a National Health and Medical Research Council emerging leader research fellow in the University of Sydney School of Public Health and part of the Sydney Health Literacy Lab.\n\nAside from overdiagnosis, these medical tests don't begin and end in the span of a social media video. They require resources, which Nickel says are getting taken away from people who actually need them.\n\n\"It creates so many inequities in the health care system, and it really plays on this emotion of early detection and early screening in the hope of living your best life,\" Nickel says.\n\n\"That's what we saw in our study across those five tests was that underlying theme of living your best life … But there's no evidence to support those tests.\"\n\n\"People trust information from people who are similar to them or at least can empathize with their own cultural or personal experiences.\" Dr. Garth Graham, cardiologist, Google Health/YouTube global head of health care and public health\n\nHow far will people go in the name of controlling their health to be their best selves?\n\nDeMille signed up for Instagram while getting a diploma in fitness and health promotion in her mid-20s. She says she was affected by wellness influencer culture, but, as she doesn't have a chronic illness, the harm was only mild. Now, while on Instagram, she was more focused on how she looked, rather than how she felt.\n\n\"A lot of it is these wellness and fitness influencers who are using their body as a business card basically,\" DeMille says. \"I was buying supplements and powders that I didn't need, and that I didn't even like … I was restricting my diet in ways that I didn't need to.\"\n\nDeMille began to question one influencer who claimed to have healed precancerous cells with food and supplements. Subsequently, the Australian Cancer Council said this influencer's claims lacked scientific evidence and were potentially dangerous. The influencer never responded.\n\nIt's an all-too-common occurrence among influencers, DeMille says. \"Can they really care about the health and wellness of the people following them if expert societies are calling them out and they're not saying anything?\"\n\nSince she started posting videos challenging wellness influencers, DeMille has heard stories from people who say that because their loved ones followed influencers who said they could heal their cancer naturally, they went against their doctor's wishes and declined chemotherapy, radiation or surgery. These stories typically end one of two ways: the wellness influencers' followers were finally convinced to get the treatment they needed, or they're no longer with us.\n\nAn August 2025 study that Baker worked on found that 81% of \"cancer cure\" videos on TikTok featured false and misleading advice. This was out of 200 videos that were analyzed.\n\n\"The best that can happen is you lose money, time and energy,\" DeMille says of following wellness influencers' advice on social media. \"The real harm is that someone is influenced by these parasocial relationships they have online to forgo evidence-based treatment or health care, should they need it.\"\n\nThis is also a concern among public health experts. Steier worries that people may think they can avoid an annual physical with a primary care doctor by participating in wellness trends.\n\n\"They think that they have a stomachache, so they're just going to do a parasite cleanse or a detox tea instead of actually going to a physician and getting clinically diagnosed.\"\n\n58% of people age 18-34 regretted a health decision they made based on misinformation. Getty Images/Zooey Liao/CNET\n\nSame snake, different oil\n\nMisinformation around health and wellness isn't new. The term \"snake oil\" became popular during the late 1800s after entrepreneur Clark Stanley — also known as the \"Rattlesnake King,\" which could easily be a screen name — began marketing rattlesnake oil as having healing powers. In 1917, federal investigators determined that Stanley's Snake Oil had nothing to do with snakes and was, in fact, just mineral oil.\n\n\"There's a direct connection in some ways to some of the challenges we see now back to snake oil salespeople,\" Southwell says. \"What's helpful about that to me is not to suggest that we're still terrible at dealing with this, but rather, there are probably good reasons why that's been with us for a while … There are certain aspects of human beings that we need to keep in mind.\"\n\nHumans will seek answers to the questions they have, especially if they can improve their lives.\n\n\"To create misinformation takes minutes. To debunk misinformation sometimes takes weeks.\" Andrew Pattison, WHO Department of Digital Health and Innovation team lead of digital channels\n\nPeople's attempts to take control of their own health aren't new either. The medical freedom movement of the 1980s, coinciding with the Reagan era, promoted \"healthism,\" an individual's right to make decisions in health care, as opposed to the government or medical establishments. It heightened the notion that one's worth is tied to one's health. Wellman sees this as the foundation of the modern MAHA movement.\n\nIt became even easier to make this impact with the expansion of internet access in the 2000s. People could now share their own health and wellness stories — or medical misinformation — in just a few clicks.\n\nSouthwell stressed that this content gains traction because it answers questions that people in need have. \"If you're especially in distress or you're looking for answers, you're emotional and frustrated, you're going to gravitate to the information that's clearly presented to you, that seems to be relevant and that finds you in your feed.\"\n\nTech's transparency about misinformation\n\nTikTok, Meta and YouTube have policies to prohibit or respond to misleading or false content, some stronger than others.\n\nWith the help of moderators and over 20 independent, accredited fact-checking organizations, TikTok says it \"prohibits inaccurate, misleading or false content that may cause significant harm to individuals or society.\"\n\nMeta says it will remove misinformation when it's likely to directly contribute to the risk of imminent physical harm, but in March it launched a new feature called Community Notes — similar to what happens on X, which doesn't have a misinformation policy.\n\nInstead of using third-party fact-checking organizations, Meta's Community Notes let you submit a note on Facebook, Instagram and Threads posts you believe are potentially misleading or confusing. But for someone's note to be published on a post, people who have disagreed on note ratings in the past will need to agree that a note is worth posting. If there is no agreement, it won't be published.\n\n\"Meta does not decide what gets rated or written — the community does,\" Meta says.\n\nDr. Garth Graham, global head of health care and public health partnerships at YouTube and Google Health YouTube/Getty Images/Zooey Liao/CNET\n\nOn YouTube, Graham helped create YouTube Health, a platform featuring public health and clinical experts who populate it with high-quality health information.\n\n\"We label information as coming from licensed doctors, nurses, therapists, government entities and accredited institutions like hospitals, so that people are able to differentiate whether the information is coming from a more qualified source,\" says Graham. When you search health topics such as \"diabetes,\" YouTube has a carousel of videos at the top labelled as \"from health sources,\" making this content easier to access.\n\nThe verification and whitelisting of medical experts is something Rubin would like to see more of across all platforms, as some of his content, and his colleagues', has been flagged as misinformation in the past. He emphasized the need to separate actual experts with accreditation from influencers, saying people who want to spread misinformation use bots to mass-report accounts in an attempt to get them banned.\n\n\"The best that can happen is you lose money, time and energy. The real harm is that someone is influenced by these parasocial relationships they have online to forgo evidence-based treatment or health care.\" Mallory DeMille, Conspirituality podcast correspondent\n\nAt the end of the day, people will continue to search online for helpful health information.\n\nThis echoes what Varshavski told me was one of his reasons for being on social media: \"I was trained as a family medicine doctor. We go to where our patients are. If they're in the ER, we're there. If they're admitted to the hospital, we're there. Nursing homes, home visits — we go everywhere. That's the beauty of my specialty. And one place where I felt like we weren't there for our patients was on social media.\"\n\nThe conversation surrounding what tech companies should do to regulate misinformation is nuanced. In April 2025, a Pew survey found that 60% of Americans believe tech companies should take steps to restrict false information online, which is down from 65% in 2023.\n\nThe trick sometimes is in deciding where the boundaries lie -- and in avoiding outright censorship. Science-based research evolves over time, and medical professionals aren't always perfect.\n\n\"One of the challenges that you find is that any source, any one of us, is capable of sharing inaccurate information, of sometimes being wrong or there being errors,\" Southwell says. \"The nature of our information environment makes it possible for inaccurate information to exist ... if it weren't a problem, we would have such a tightly sanitized, censored environment. I wouldn't want to live in that world either, so we have to live with the messiness of what we have.\"\n\nDuring the pandemic, Southwell was part of a team, along with the WHO, the National Academy of Medicine and Council of Medical Specialty Societies, that worked on global principles for identifying credible sources of health information on social media. The objective was to provide tech companies with principles for boosting evidence-based information over misinformation.\n\nExperts also emphasize that with the funds and technology available to them, social media companies can create tools that protect users from misinformation while also benefiting their businesses.\n\n\"Let's put technology, intelligence, large resources and common sense from the health industry together to find solutions,\" says Pattison.\n\nPattison believes it's important to ensure that everyone has a seat at the table when discussing these issues, including the tech companies themselves. That's why the WHO has a Tech Task Force, which meets with over 30 companies monthly to present problems and discuss potential solutions.\n\nThe treatment for medical misinformation\n\nOne action we can all take in the fight against misinformation is to never consume wellness content in a vacuum. As they say about diagnoses, it's best to get a second opinion. Talk to your doctor about it. Ask your friends and family what they've heard. Look to see if the influencer has any accreditation. Check if the video is a paid sponsorship or if there are disclosures in an influencer's bio or on their website.\n\nSocial media platforms have a vital role to play, but much of the burden falls on us, as consumers of health information. We need to think critically about what we're encountering when we scroll through our social media feeds.\n\nDigital literacy matters, too. That would make more people think twice before sharing questionable content or, simply, content that evokes an emotional reaction.\n\n\"Sharing posts is what's going to trip the algorithm to want to amplify it to more people, so it's a matter of taking a second to decide: Are you going to trigger yourself?\" Rubin says. \"Because as you share it, you also get fed more of that content, and that's what ends up creating these echo chambers and amplifies unproven, potentially dangerous therapies.\"\n\nWe also need to recognize why people are turning to social media for answers to their health questions in the first place -- because they don't have access to a trusted health care provider. It seems this will only become more challenging.\n\nAs of November 2024, the National Center for Health Workforce Analysis estimated that by 2037, there will be a shortage of 87,150 full-time equivalent primary care physicians. This shortage is expected to have a particularly significant impact on non-metro areas.\n\nThere also needs to be more funding for accredited experts to communicate with the public, which can require significant time and effort, making it a full-time job. In response to federal scientific research funding cuts, initiatives are working toward reducing this disparity, such as the Scientist Network for Advancing Policy, a group of early-career scientists mobilizing to bring scientists and their communities together. You can fill out their interest form to get involved. To share your thoughts about these funding cuts, you can contact your elected officials.\n\n\"Anything that makes you excited is going to be engaging content, whether it's fear or excitement.\" Andrew Pattison, WHO Department of Digital Health and Innovation team lead of digital channels\n\nTo further bridge this gap, many doctors on social media accept corporate sponsorships that pay not only for their time and effort but also for disseminating their educational content to a wider audience. However, this often comes with pushback, especially involving concerns around conflicts of interest.\n\n\"If I accept any funding, I'm criticized. I'm called things like 'a shill,'\" Steier says. \"This is frustrating because it means that in the science space, we can't be compensated for our time and effort, whereas you have the wellness influencers, who don't have that same code of ethics or are not held to that same standard, and they're making a full-blown living. All of their efforts are compensated.\"\n\nThough funding is currently lacking, the importance of communication in health care is clear, whether a doctor is talking to a single patient in an exam room or aiming to educate the masses online.\n\n\"One of the main things we can do to help is to show up for them,\" says Graham. \"We have to recognize that patients are taking a journey with health information online, and the question is, how can we make it a better, more high-quality journey?\"\n\nEven if you don't have a trusted doctor you can turn to, you should be able to reach out to your community for help. After all, what are people really looking for online? A community that understands them. But finding a real-world community has become increasingly difficult.\n\nThat's the role that online influencers have taken over, and too often, not for the better.\n\nBetween having to navigate the landscape of misinformation while trying to access our current health care system, it's natural to feel frustrated. However, we can't let that discourage us from thinking critically about the content we're consuming and, ultimately, pursuing the truth.\n\nAny one of us can be lured into the trap of misinformation when we're simply seeking help that isn't readily available. Because what does searching for answers about our health represent in the grand scheme of life? A desire for control. The fear of death. The will to live. And those are feelings we can all relate to.\n\nVisual Designer | Zooey Liao\n\nArt Director | Jeffrey Hazelwood\n\nCreative Director | Viva Tung\n\nVideo Presenters | Owen Poole, Tharon Green, Wesley Ott, JD Christison\n\nVideo Editor | JD Christison\n\nProject Manager | Danielle Ramirez\n\nEditor | Corinne Reichert\n\nDirector of Content | Jonathan Skillings",
      "category": "technology",
      "source": "CNET",
      "link": "https://www.cnet.com/health/features/modern-day-snake-oil-how-wellness-influencers-gained-power-spread-health-misinformation/",
      "date": "2025-11-18"
    },
    {
      "id": "4137",
      "title": "I'm an American working remotely in Italy. I knew moving would be hard, but I never considered one stressful hidden cost.",
      "description": "As an American living in Italy but still working with US clients, I wish someone warned me how much exchange rates could impact my life and budget.",
      "body": "I'm an American living in Italy, working as a freelancer in the same field I did back home. Before I moved, I didn't consider one stressful hidden cost of keeping my clients in the US.\n\nI'm an American living in Italy, working as a freelancer in the same field I did back home. Before I moved, I didn't consider one stressful hidden cost of keeping my clients in the US. Katie Carson\n\nI'm an American living in Italy, working as a freelancer in the same field I did back home. Before I moved, I didn't consider one stressful hidden cost of keeping my clients in the US. Katie Carson\n\nlighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nMoving abroad is often painted as a romantic leap — a bold woman, a plane ticket, and an \"Under the Tuscan Sun\"-esque dream.\n\nAnd sure, it can be that. But many not-so-glamorous spreadsheets, late-night money panics, and small acts of courage go into making that dream even remotely possible.\n\nI'm a solo female freelancer who recently moved from the United States to Florence, Italy, with my 60-pound dog, Archie, in tow.\n\nAfter nearly a year of research, I decided Italy was the most logistically and financially feasible choice for me … even though I'd never been to the country before.\n\nThe visa seemed accessible to me, the city was walkable, and Florence had the right mix of history, beauty, and a central location to help me figure out where I might want to land long term.\n\nBy April, I'd mapped out my move: I'd canceled my lease in the US, sorted my visa, hired a pet mover for Archie, and lined up client work. I arrived in Florence in mid-June, with my rent for the month already paid.\n\nI knew I'd experience culture shock, loneliness, and logistical headaches, but I felt prepared … until July rolled around and I saw what the exchange rate had done to my rent.\n\nSoon, I realized just how hard it would be to manage a budget across two currencies\n\nI knew moving to a new country would come with challenges, but I didn't predict all of them. Katie Carson\n\nLike many American freelancers abroad, I'm still paid by my clients in US dollars. However, I pay for my rent, utilities, groceries, and dog food in euros.\n\nAnd when the dollar dips and the currency exchange rate isn't in my favor, things can feel expensive, fast.\n\nWhen I went to pay July's rent, the dollar had dropped enough that I owed nearly $300 more than the month before.\n\nSame apartment, same price in euros. However, thanks to the exchange rate, it hit my bank account completely differently.\n\nNo one and nothing had warned me about this — not the expat course I took or dozens of blogs I read and YouTube videos I binge-watched from others who moved abroad.\n\nAnd yet here I was, staring at currency charts, trying to time the transfer just right. Eventually, I gave up. The rate didn't bounce back, and I needed to pay my bills.\n\nI converted the money, paid the rent, and reminded myself of something I'd said a dozen times during this move: I'd figure it out. I always do.\n\nCreative problem-solving — and dating — is now part of my job\n\nSometimes, I get work done from local restaurants and cafés. Katie Carson\n\nLiving solo anywhere means you have to be your own safety net. There's no second income to fall back on or partner to split the rent with.\n\nI can't control how the exchange rates between euros and US dollars fluctuate — especially now, as economic uncertainty makes the changes trickier than ever to predict.\n\nBecause I'm on a digital-nomad visa, I also have to keep my income tied to work outside of Italy. I'm not looking for European clients yet, but I'm preparing by learning the local language and easing into the culture with the hope of picking up EU-based work in the future.\n\nI keep watching conversion rates — and crossing my fingers they may even be in my favor one day. Until then, I'm getting creative and taking control of what I can.\n\nI've landed new podcast clients, followed up on old leads, and started exploring affiliate income opportunities. I've even considered monetizing my own podcast for the first time.\n\nI moved some of my savings to an interest-bearing euro account. I've opened my guest room to fellow solo female travelers for short stays in exchange for help with groceries and utilities.\n\nI began using apps like Too Good To Go — where I can buy extra food from cafés and restaurants at a discount — to save money, reduce food waste, and try new local spots.\n\nAnd yes, dating helps too. A coffee or dinner invitation where someone else picks up the check doesn't just ease the budget; it eases the loneliness.\n\nConnection softens the isolation that can creep in when you're half a world away from your people.\n\nEven on hard days, I know I made the right move\n\nI chose this life for me and my dog, and I love it. Katie Carson\n\nBeing six to nine hours ahead of most of my friends and clients has its perks (hello, uninterrupted mornings), but it can also feel isolating.\n\nI'm still practicing my Italian and figuring out how to meet people or even hold full conversations at the dog park.\n\nEven when the dollar drops or I feel completely alone, though, I don't regret this move for a second. I walk more, eat better, breathe deeper, and I'm no longer rushing all the time.\n\nBut the reality is that I'm figuring out a lot of things in real time, with no trust fund or Instagram-worthy villa behind me.\n\nThe dream is real … but so is the math. I can't fully plan my way out of uncertainty, but I can continue to build a life that's flexible, self-sustaining, and entirely my own.",
      "category": "international",
      "source": "Business Insider",
      "link": "https://www.businessinsider.com/moved-to-italy-kept-job-in-united-states-surprising-challenge-2025-11",
      "date": "2025-11-18"
    },
    {
      "id": "deea",
      "title": "How to get Sarah Millican tickets: Final 2025 comedian tour dates",
      "description": "Don't miss out on these last 2025 dates to see Sarah Millican in the US. Here's where she's performing and how much tickets cost.",
      "body": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nLooking for some laughter in this news cycle? Sarah Millican’s silly and often brutally honest discussions might be the ticket you could benefit from. After all, laughter is often the best medicine, regardless of your gender. I've gathered how to get Sarah Millican tickets below to help you get started.\n\nAn inconspicuous comedian, Millican appears to be someone that you might see at a Sunday church service or a person you might pass at a grocery store. However, don’t let this “ordinary” appearance fool you. Millican is a pistol on the stage. After sampling her previous shows via YouTube, I'm happy to report her sets filled with wild talk of intimacy, genitalia, and dating apps, all with a softness and smile about her that genuinely caught me a bit off guard.\n\nMillican’s upcoming shows are part of her Late Bloomer tour, which, I gotta say, I have found myself relating to quite a bit after watching some of her clips on YouTube. She sheds light on our differences through interactions with the audience, making it no surprise that she has become one of the most revered comedians in Britain. Her looks and comedic bits are relatable to so many.\n\nThat said, if you want to see her performing one of her sets live, we’re giving you a heads-up with deals for tickets on StubHub and Vivid Seats. Each show will be two hours of relatable comedic silliness. It’s a treat that, regardless of your style choices, you’re bound to connect with.\n\nSarah Millican’s 2025 tour schedule\n\nSarah Millican is wrapping up the year with a series of shows across the US. The remaining dates include Atlanta, Nashville, Miami Beach, and St. Petersburg.\n\nNorth America\n\nDate City StubHub prices Vivid Seats prices November 18, 2025 Atlanta, GA $111 $107 November 19, 2025 Nashville, TN $106 $159 November 21, 2025 Miami Beach, FL $60 $55 November 22, 2025 St. Petersburg, FL $135 $211\n\nFollow our WhatsApp channel and Instagram for more deals and buying guides.\n\nHow to buy tickets for Sarah Millican’s 2025 concert tour\n\nMany of the shows have sold out or are increasing in price on resale sites. Millican has even graciously taken to Instagram to discuss the lack of available tickets for many of her coming shows. She genuinely seems to care about her fans. It’s quite endearing to see the attention she is giving them.\n\nOriginal shows are on sale via Ticketmaster. Since her shows often involve discussions about adult content, you may see notes about how you have to be sixteen or older to go to the shows.\n\nHow much are tickets?\n\nMany of Millican’s last remaining shows have already sold out. The most notable date is the November 17th Las Vegas show, which is only available on StubHub.\n\nAll shows except those on November 5th, 16th, and 21st are showing as sold out on Ticketmaster.\n\nMany of the remaining tickets are located far from the stage. The shows would make for a relaxing and silly evening out for folks heading to a show. Bring a friend or a partner or a group (if you can score enough tickets) and enjoy the show from wherever you can.\n\nWho is opening for Sarah Millican’s tour?\n\nThese shows are just Millican. She will be performing hour two-hour-long stand-up each night of her tour dates. Millican is one of the most prominent comedians in Britain, though. She’s the only entertainer you’ll need for the night.\n\nWill there be international tour dates?\n\nMillican finished touring internationally before embarking on the latter half of her tour dates in the United States. There are potentially a couple of international shows coming up in December, but tickets have not gone on sale yet. It is unknown if those dates will be finalized, as they only show as possible dates on StubHub.\n\nWho is Sarah Millican?\n\nSarah Millican is a comedian from the UK who came to fame after winning the 2008 Edinburgh Festival Fringe. The Edinburgh Festival Fringe has hosted several major comedians over the years, including Robin Williams, Suzy Eddie Izzard, Rachel Weisz, and Graham Norton. As you can tell from the other big names here, winning this event for Best Newcomer was a huge feat, putting Millican in the company of comedy greats.\n\nShe is a renowned comedian revered in the UK. Her successes have made her the only woman to make the top ten list of Britain’s richest comedians.\n\nIs Sarah Millican in any movies or shows?\n\nMillican was a contestant on the 14th season of Taskmaster, which aired back in September of 2022. Following her second-place success, she announced her current tour, which has taken part in two waves. She has performed several comedic specials, including Control Enthusiast, Outsider, and Home Bird, among others, which are available to watch on her website.",
      "category": "economy",
      "source": "Business Insider",
      "link": "https://www.businessinsider.com/guides/tickets/how-to-get-sarah-millican-tickets-comedy-tour",
      "date": "2025-11-18"
    },
    {
      "id": "be47",
      "title": "The US just minted its last penny. I'm keeping the ones my grandparents saved.",
      "description": "As the US mints its last penny, I can't help feeling nostalgic for the tiny coin that shaped my childhood and still brings me luck.",
      "body": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThere's an old saying, \"Find a penny, pick it up, all day you'll have good luck.\" I've always wanted to believe it's true. Our local bagel shop still has a small coin dish on the counter near the register, where people can take or leave a penny as needed.\n\nInside a box in my closet are three navy blue penny collection books, which my father sent to me after my grandparents died. The books were made by the Whitman Publishing Company in Racine, Wisconsin. The oldest penny in the collection is from 1910, of which 146.8 million were made.\n\nThe author inherited a penny collection. Courtesy of the author\n\nNow they are my prized collection.\n\nMy grandparents collected coins\n\nPennies have been jangling around the bottoms of purses and car floorboards, collected in coffee mugs, glass jugs, and other vessels for generations. What baby boomer or Gen X-er hasn't dug between couch cushions to scrounge up loose change to buy candy, gum, or a soda? That tiny pocket on your jeans was originally designed to hold a pocket watch, but as a teenager in the 80s, it held dimes or quarters for the pay phone, and maybe even a lucky penny or two.\n\nMy grandparents collected coins and introduced me to their hobby when I was young. I didn't stick with it, but the activity instilled a couple of things. I became more observant, excitedly checking the year on every penny I found. If you saved enough of them, who knew what they might add up to.\n\nI recall going to the bank to obtain the brown paper sleeves for rolling pennies. Twenty-five in each. Every fourth sleeve equaled another whole dollar.\n\nCourtesy of the author\n\nIt doesn't happen often anymore, but nothing exasperates my kids faster than me digging for exact change at the checkout. \"No one wants your coins Mom,\" they'll say loudly while looking apologetically at the cashier. I've taught them it all spends the same. There are, however, some rules regarding the use of change, especially pennies. As a waitress in my younger days, it's a well-known fact that leaving pennies as a tip is considered a sign of disrespect.\n\nI've always loved pennies\n\nOne night in the mid-80s, a group of teenagers came into the coffee shop in Running Springs, California, where I worked the 3 p.m. to 11 p.m. shift, at 10:45 p.m. They wanted milkshakes, and I'd already cleaned the machine. I told them we don't usually make shakes that late, but I'd make an exception for them. I was also intimidated and wanted to show them kindness that most people in town didn't.\n\nWhen it was time to pay the bill, they left a pile of change that barely covered the cost of the shakes, including a lot of pennies. I remember being mad and embarrassed that I'd tried too hard. In that instance, all those pennies made it feel worse.\n\nThe penny has a long history of being problematic in one way or another. I've always loved them. Maybe because of a more personal connection. An early childhood memory is of my maternal grandfather, pointing at a penny on the ground, picking it up, and exclaiming in his booming Armenian voice, \"You know you're related to this guy?\" According to Ancestry, I'm a 6th cousin, five times removed, from our 16th President — the iconic face of the penny —through my maternal great-grandmother, Martha, whose maiden name was Lincoln.\n\nThe US won't produce any more pennies\n\nWhile inevitable, the news of the US minting its last penny on November 12, 2025, feels bittersweet. I find myself wondering if my grandchildren will appreciate the collection. It feels strange and a bit sad that they don't have much exposure to coins as a form of currency. They'll never know the thrill of finding a wheat penny, or looking at an old coin and wondering about all the places it's been.\n\nIn 2001, I remarried, relocated from Southern California to the Philadelphia suburbs, and secured a position as a corporate secretary. Not long after I started, I went shopping with one of my bosses who'd become a fast friend to buy a new wallet. After purchasing, she handed me a shiny penny (which I still have) to put inside. For luck, she said.\n\nI feel a kind of reverence for a penny on the ground, a \"hello\" from my grandparents. Having experienced financial insecurity, it feels disrespectful to ignore a penny on the floor. It's always been, for me, a symbol of little things that add up to big things. That, and the sight of my cousin, Honest Abe's face, lying on the ground, will keep me picking up stray pennies.",
      "category": "economy",
      "source": "Business Insider",
      "link": "https://www.businessinsider.com/ive-always-loved-pennies-heres-why-their-disappearance-hurts-2025-11",
      "date": "2025-11-17"
    },
    {
      "id": "2b97",
      "title": "I've been to all 63 major US national parks. Here are 10 things I'd never visit one without.",
      "description": "As someone who's traveled to all 63 major US national parks, I always pack a first-aid kit, multiple layers of clothing, sun protection, and snacks.",
      "body": "I've learned that snacks are one of the many important things to bring to the national parks.\n\nI've learned that snacks are one of the many important things to bring to the national parks. Emily Hart\n\nI've learned that snacks are one of the many important things to bring to the national parks. Emily Hart\n\nlighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nHave an account? Log in .\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nAfter spending a decade visiting all 63 major US national parks solo, I've found that it doesn't take a lot of gear to get out into the wild and enjoy the experience.\n\nStill, there are a few practical items that are definitely worth bringing along before heading into a park.\n\nThese items are best suited for visits to parks that can be enjoyed without long hikes or backpacking, but no matter the trip, it's always important to plan and be prepared.\n\nHere are 10 items I never enter national parks without.",
      "category": "technology",
      "source": "Business Insider",
      "link": "https://www.businessinsider.com/things-to-bring-national-parks-traveler-who-visited-all",
      "date": "2025-11-18"
    },
    {
      "id": "d369",
      "title": "Off-grid couple shares video of clever solution to wintertime problem: 'They have not been happy'",
      "description": "\"Hopefully this is the new page for us.\"",
      "body": "An off-grid couple on TikTok is keeping warm and addressing a common solar power storage issue as winter approaches.\n\nA TikTok user (@crimsonkennel.offgrid) shared their current off-grid project at their home in British Columbia, keeping their solar controllers and battery storage at a high capacity as they head into winter.\n\n\"With the cold weather, they have not been happy,\" they say.\n\nThe sound and flashing red alarm on their maximum power point tracking (MPPT) solar controller was triggered due to low temperatures and reduced capacity. So, they built an insulated enclosure, resembling a doghouse, to keep the six storage batteries and solar controller in a temperature-controlled area.\n\nIn an update, they shared that this allowed them to have power until 7:15 in the morning, the longest they've maintained power through the night since experiencing issues with their solar setup.\n\nAdvertisement Advertisement\n\n\"So crossing my fingers that hopefully this is the new page for us and we figured it out because winter is coming,\" they said in an update. The following day went even better as they had power all night and morning.\n\nIn cold weather, an alarm on an MPPT solar controller typically indicates that charging has been stopped to protect lithium batteries from low-temperature damage. Lithium iron phosphate batteries can suffer permanent damage if charged below freezing, a condition known as lithium plating. Therefore, finding a way to keep them insulated is crucial, especially for off-grid systems.\n\nSolar panels like those used by the couple for their off-grid lifestyle can also help grid-connected homeowners reduce their energy costs to around $0. EnergySage provides a free service that makes it easy to compare quotes from vetted local installers and save up to $10,000 on solar installations.\n\nHowever, due to the upfront investment, purchasing solar panels may not be feasible for all homeowners, but leasing solar panels can still be a good option for those looking to avoid the high and fluctuating energy prices of nonrenewable sources while also helping cool the planet. Palmetto's LightReach solar panel leasing program installs panels for no money down and allows users to lock in low energy rates.\n\nAdvertisement Advertisement\n\nOff-grid fans in the comments appreciated the solar solution.\n\n\"Nice!!\" one wrote. \"They will be a little more cozy in there!!\"\n\nOthers hoped they would last through the winter: \"Fingers crossed.\"\n\nJoin our free newsletter for easy tips to save more and waste less, and don't miss this cool list of easy ways to help yourself while helping the planet.\n\n\n\n",
      "category": "international",
      "source": "Yahoo Entertainment",
      "link": "https://www.yahoo.com/lifestyle/articles/off-grid-couple-shares-video-170000655.html",
      "date": "2025-11-17"
    },
    {
      "id": "d279",
      "title": "Ukraine to import US liquefied natural gas via Greece",
      "description": "Vital supplies are due to start flowing from the Balkans as energy infrastructure faces sustained Russian attack.",
      "body": "Ukraine to import US liquefied natural gas via Greece\n\n1 day ago Share Save Patrick Jackson BBC News Share Save\n\nReuters Ukraine's energy facilities are under sustained attack\n\nVital supplies of US liquefied natural gas are due to start flowing into war-ravaged Ukraine this winter via a pipeline across the Balkans. The deal was announced after Ukrainian President Volodymyr Zelensky met Greek Prime Minister Kyriakos Mitsotakis in Athens on Sunday. Greece is working to increase the flow of American LNG to its terminals to \"replace Russian gas in the region\", Mitsotakis said recently. The European Commission plans to ban all imports of Russian gas to EU member states by the end of 2027, arguing revenue from such sales funds Russia's war in Ukraine. In Ukraine, which experiences freezing winters, there are fears of an energy crisis as Russia attacks energy facilities.\n\nAnadolu via Getty Images Mitsotakis (L) with Zelensky in Athens\n\nZelensky is currently in France, where he President Emmanuel Macron signed a letter of intent to buy up to 100 Rafale jets. Fighting continued overnight, with six people reportedly killed in Russian attacks in the Kharkiv, Kherson and Donetsk regions of Ukraine. Russia's military said it had taken control of three more Ukrainian villages - one each in the Kharkiv, Donetsk and Dnipropetrovsk regions. None of the reports could be independently verified. Speaking earlier in Athens, Zelensky was quoted as saying that deliveries of US LNG would begin in January. \"We rebuild each time the Russians destroy but this truly requires time, much effort, equipment and, regarding gas... imports to compensate for the destruction by the Russians of our own production,\" he said. \"Greece is becoming an energy security provider for your homeland,\" Mitsotakis told the Ukrainian president. Zelensky said Kyiv had allocated funds for gas imports from European partners and banks under European Commission guarantees, as well as from Ukrainian banks, to help cover imports through to March at a cost of nearly €2bn (£1.8bn; $2.3bn), according to news agency Reuters. Since 2015, when it stopped buying Russian gas directly, Ukraine has been receiving supplies from various EU states. The Soviet-era Trans-Balkan pipeline links Ukraine to LNG terminals in Greece via Moldova, Romania and Bulgaria. The UN Office for the Co-ordination of Humanitarian Affairs has issued a formal warning, saying \"the approaching winter poses new risks for Ukrainians... as intensified attacks on energy networks undermine efforts to maintain warmth in homes, schools and health centres\".\n\nThe letter signed by Zelensky and Macron while visiting the Villacoublay air base near Paris sets out possible future contracts for Ukraine to acquire Rafale fighter jets \"with their associated weapons\". The letter, which is not a purchase and sales contract, also sets out deals for SAMP-T air defence systems, radar systems and drones. On an visit to Sweden last month, Zelensky signed a letter of intent to buy between 100 and 150 Gripen fighter jets. In France, Zelensky also went to Mont Valerien, to the west of Paris, to visit the nascent headquarters of a planned multinational force. The force, which was proposed by the UK and France, may one day help oversee a Ukraine-Russia ceasefire. Tens of thousands of people, most of them soldiers, have been killed or injured, and millions of civilians have fled their homes, since Russian President Vladimir Putin launched his full-scale invasion of Ukraine in February 2022. Russia currently controls about 20% of Ukraine's territory and has been making slow advances along the front line as the Ukrainian military grapples with manpower shortages. Fighting has centred on the town of Pokrovsk, a logistical hub in Donetsk region, where hundreds of Russian troops recently broke through. Ukraine's ongoing refugee crisis took another turn this month when German Chancellor Friedrich Merz urged Zelensky to take action after a surge in the number of young Ukrainian men arriving in Germany and other EU states as refugees. EU states recorded 79,205 new Ukrainian refugees in September, the highest monthly number in nearly two years. In its report, the EU's statistical agency pointed to Ukraine's decision in August to allow men aged 18 to 22 the right to cross the border freely. At the time of the invasion, martial law dictated that men aged between 18 and 60 – even those not eligible for conscription, which is currently in place for those aged between 25 and 60 – were not permitted to leave the country. Germany, the EU's biggest country, now hosts the most Ukrainian refugees - currently 1.2 million people or 28.3% of the bloc's total.",
      "category": "politics",
      "source": "BBC News",
      "link": "https://www.bbc.com/news/articles/c0ex0y0p31jo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "date": "2025-11-17"
    },
    {
      "id": "9ad3",
      "title": "US government issues a surprising warning about Japan travel",
      "description": "Welcoming a record 36 million international visitors in 2024 and 21.5 million thus far in the first half of 2025, the Asian nation of Japan's tourism...",
      "body": "Welcoming a record 36 million international visitors in 2024 and 21.5 million thus far in the first half of 2025, the Asian nation of Japan's tourism...\n\nWelcoming a record 36 million international visitors in 2024 and 21.5 million thus far in the first half of 2025, the Asian nation of Japan's tourism industry growth surpasses that of almost every ot",
      "category": "politics",
      "source": "TheStreet",
      "link": "https://www.thestreet.com/travel/us-government-issues-a-surprising-warning-about-japan-travel",
      "date": "2025-11-18"
    },
    {
      "id": "1b1b",
      "title": "Immigrant student enrollment is dwindling at schools across the US",
      "description": "From Miami to San Diego, schools around the U.S. are seeing big drops in enrollment of students from immigrant families. In many school systems, the biggest...",
      "body": "From Miami to San Diego, schools around the U.S. are seeing big drops in enrollment of students from immigrant families.\n\nIn some cases, parents have been deported or voluntarily returned to their home countries, driven out by President Donald Trump’s sweeping immigration crackdown. Others have moved elsewhere inside the U.S.\n\nIn many school systems, the biggest factor is that far fewer families are coming from other countries. As fewer people cross the U.S. border, administrators in small towns and big cities alike are reporting fewer newcomer students than usual.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn Miami-Dade County Public Schools, about 2,550 students have entered the district from another country so far this school year — down from nearly 14,000 last year, and more than 20,000 the year before that. School board member Luisa Santos, who attended district schools herself as a young immigrant, said the trend is “a sad reality.”\n\n“I was one of those arrivals when I was 8 years old,” Santos said. “And this country and our public schools — I’ll never get tired of saying it — gave me everything.”\n\nCollectively, the enrollment declines in Miami-Dade erased about $70 million from the district's annual budget, forcing administrators to scramble to cover the unexpected shortfall.\n\nThe drops in immigrant students add to strains on enrollment at many traditional public schools, which have seen overall numbers dip due to demographic changes and students opting for alternatives like private schools and homeschooling. Despite needs for English instruction and social supports, the newcomers in some districts have helped to buoy enrollment and bring critical per-pupil funding in recent years.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn northern Alabama, Albertville City Schools Superintendent Bart Reeves has seen the local economy grow along with its Hispanic population, which for decades has been drawn by the area’s poultry processing plants. Albertville soon will be getting its first Target store, a sign of the community’s growing prosperity.\n\nReeves’ district is home to one of Alabama’s largest Hispanic student populations, with about 60% identifying as Hispanic. But Reeves said the district’s newcomer academy at a local high school hasn’t been enrolling any new students.\n\n“That’s just not happening this year with the closure of the border,” said Reeves, who expects the hit to his budget from enrollment declines will cost him about 12 teacher positions.\n\nSome students are self-deporting with their families\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOne Sunday morning in August, Edna, a 63-year-old immigrant from El Salvador, got the call she had been dreading. Her friend, a mother from Guatemala with seven young children, had been detained in Lake Worth, Florida, on immigration charges while she was out grabbing a treat for her kids’ breakfast.\n\nThe family had prepared for this moment. There were legal documents in place granting temporary custody of the children to Edna, who asked to be identified only by her first name because she fears immigration enforcement.\n\n“I’ll be here, and we’ll be OK,” she recalled telling the oldest child, a 12-year-old boy.\n\nIn the weeks that followed, Edna stayed home with two younger kids and got their five older siblings on the bus each day to attend Palm Beach County public schools, where enrollment has fallen by more than 6,000 students this year. One day in September, all seven children boarded a plane to Guatemala to be reunited with their mom, leaving behind neighborhood friends, band practices, and the only life they had ever known.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“My house feels like a garden without flowers,” Edna said. “They’re all gone.”\n\nThe family is now living in a rural part of Guatemala, out of reach of phone service. School there had already started for the year and the mother, who did not attend school herself as a child, was keeping them home and weighing whether to enroll them next year, Edna said.\n\nSchools accustomed to newcomers see far fewer this year\n\nThe declines in the numbers of immigrants coming to the U.S. were already becoming evident in school registration numbers this summer.\n\nDenver Public Schools enrolled 400 new-to-country students this summer, compared to 1,500 during the previous summer. Outside Chicago, Waukegan Community Unified School District 60 signed up 100 fewer new immigrant students. And administrators in the Houston Independent School District shuttered the Las Americas Newcomer School, a program dedicated to children who are new to the U.S., after its enrollment fell to just 21 students from 111 last year.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe shift is visible in places like Chelsea, Massachusetts, a city outside Boston that has long been a destination for new immigrants. The 6,000-student Chelsea Public Schools system has attracted Central Americans looking for affordable housing, and more recently, the state housed newly-arrived Haitians in shelters there. This year, the usual influx of newcomers didn’t materialize.\n\n“This year has been different. Much more quiet,” said Daniel Mojica, director of Chelsea’s parent information center.\n\nOver the summer, 152 newcomers signed up for Chelsea Public Schools, compared to 592 new-to-country students the previous summer.\n\nSome are also picking up and leaving. Since January, 844 students have withdrawn from the district, compared to 805 during the same period last year. Mojica said a greater share of students leaving – roughly a quarter – are returning to their native countries.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe attributes that partly to the presence of masked Immigration and Customs Enforcement officers walking the city’s streets.\n\n“You can feel the fear in the air,” he said.\n\nEducators worry students are missing out\n\nIn San Diego, Principal Fernando Hernandez has enrolled dozens of newcomer students from across Latin America over the past couple years. Many made the treacherous journey through the jungles of the Darien Gap before setting up camp in a park near Perkins K-8 school.\n\nAbout a third of students at the school are homeless. Staff have become experts on supporting kids who are facing adversity. As more newcomers arrived, Hernandez watched as Mexican American students switched up their playground slang to be better understood by their new classmates from Venezuela, Colombia and Peru.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut so far this school year, he hasn’t enrolled a single newcomer student. Other families did not return when the new school year began. Overall, the district's enrollment is on par with last year's, according to a spokesperson. But at Hernandez' school, the change is noticeable.\n\nHernandez fears the toll of the disruption will extend far beyond students’ academic progress. He worries students are missing out on chances to learn how to show empathy, to share, to disagree, to understand each other.\n\n“This is like a repeat of the pandemic where the kids are isolated, locked up, not socializing,” he said.\n\n“These kids, they have to be in school,” he added.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nNatacha, a parent who moved with her family to California after leaving Venezuela, said she tries to avoid going out in public, but continues sending her daughters to school. Natacha, who asked to only be identified by her first name because she fears immigration enforcement, said she braces herself as she drives the girls home each afternoon, scanning the road behind her in case another car is following hers.\n\n“I entrust myself to God,” she said.\n\n___\n\nThe Associated Press’ education coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.",
      "category": "politics",
      "source": "Yahoo Entertainment",
      "link": "https://www.yahoo.com/news/articles/immigrant-student-enrollment-dwindling-schools-045613020.html",
      "date": "2025-11-17"
    },
    {
      "id": "6ec1",
      "title": "GameStop Employees Are Freaking Out About ‘Trade Anything Day’: ‘God Help Us’",
      "description": "The promotion is really just a glorified $5 coupon day The post GameStop Employees Are Freaking Out About ‘Trade Anything Day’: ‘God Help Us’ appeared first on Kotaku.",
      "body": "The promotion is really just a glorified $5 coupon day The post GameStop Employees Are Freaking Out About ‘Trade Anything Day’: ‘God Help Us’ appeared first on Kotaku.\n\nEarlier this week, meme stock retailer turned Pokémon card pawn shop, GameStop, announced a new trade-in stunt engineered to go viral. Trade Anything Day will let customers come in and hand over almo",
      "category": "economy",
      "source": "Kotaku",
      "link": "https://kotaku.com/gamestop-trade-in-anything-day-rules-2000645098",
      "date": "2025-11-18"
    },
    {
      "id": "a209",
      "title": "Call Of Duty‘s Art Slop Leads US Congressman To Demand AI Regulation",
      "description": "The discovery of AI art in Black Ops 7 is forcing a broader discussion of the issues, and some very dumb responses The post Call Of Duty‘s Art Slop Leads US Congressman To Demand AI Regulation appeared first on Kotaku.",
      "body": "The discovery of AI art in Black Ops 7 is forcing a broader discussion of the issues, and some very dumb responses The post Call Of Duty‘s Art Slop Leads US Congressman To Demand AI Regulation appeared first on Kotaku.",
      "category": "politics",
      "source": "Kotaku",
      "link": "https://kotaku.com/call-of-duty-black-ops-7-ai-slop-regulation-2000644735",
      "date": "2025-11-17"
    },
    {
      "id": "3f83",
      "title": "WATCH: US expanding military presence near Venezuela",
      "description": "President Donald Trump has refused to rule out the possibility of military operations in Venezuela as the U.S. conducts joint military exercises in the region.",
      "body": "US expanding military presence near Venezuela President Donald Trump has refused to rule out the possibility of military operations in Venezuela as the U.S. conducts joint military exercises in the region.",
      "category": "politics",
      "source": "ABC News",
      "link": "https://abcnews.go.com/International/video/us-expanding-military-presence-venezuela-127635312",
      "date": "2025-11-18"
    },
    {
      "id": "465f",
      "title": "Binary Clock Also Monitors Weather",
      "description": "There are two things most of us want to know on a daily basis—the weather, and what time it is. [Guitarman9119] built a single device that can provide both pieces of information with a pleasingly n…",
      "body": "There are two things most of us want to know on a daily basis—the weather, and what time it is. [Guitarman9119] built a single device that can provide both pieces of information with a pleasingly nerdy aesthetic.\n\nThe heart of the build is a Raspberry Pi Pico W, which is proudly displayed on the front panel of the device. It’s responsible for driving the array of LEDs that display the time in hours, minutes, and seconds in binary format. The Pi Pico W uses its wireless connection to query the WorldTime API and an IP geolocation server. This provides the local date and time, and the location is then used to query the OpenWeather service for current weather information. The weather information is thankfully not displayed in binary format, because that would be straining to read. Instead, it’s displayed in human-readable format on a small OLED display.\n\nThere’s something about the way this is built—the discrete LEDs, that weird blue color that seemed to disappear by 1984—that gives this a wonderfully old school charm. You could imagine it turning up in a college lab full of old blinkenlights gear. Video after the break.",
      "category": "technology",
      "source": "Hackaday",
      "link": "https://hackaday.com/2025/11/17/binary-clock-also-monitors-weather/",
      "date": "2025-11-18"
    },
    {
      "id": "50d6",
      "title": "Paralegal sacked after offering to help dodge £60k illegal working fines",
      "description": "Zohaib Hussain said he could \"make documents\" to help dodge immigration fines.",
      "body": "Paralegal sacked after offering to help dodge £60k illegal working fines\n\nWatch: Undercover filming of alleged negotiation to fix a fine\n\nMr Hussain previously said he categorically denied \"all allegations, insinuations, and claims\".\n\nHis employer, RKS Solicitors, confirmed he had been \"permanently dismissed\" a day after the investigation was broadcast and a \"police report\" had been made.\n\nAt a solicitor's office in Huddersfield, Zohaib Hussain said he could \"make documents\" including \"business agreements\" for a fee of £3,500 to help dodge immigration fines.\n\nA paralegal who was secretly filmed telling a BBC undercover reporter how he can help businesses avoid fines of up to £60,000 for employing illegal workers, has been sacked.\n\nThe Home Office announced an \"urgent investigation\" involving the National Crime Agency and multiple police forces following a series of BBC reports into organised criminal networks operating on High Streets the length of Britain.\n\nThey exposed how a Kurdish crime network is enabling migrants to work illegally in mini-marts across the UK.\n\nOur investigation also uncovered a man at the centre of an immigration crime group who said he had \"customers in every city\" and could enable illegal working.\n\nFollowing the reports, senior politicians warned that the crime networks were acting as a pull factor for illegal migration to the UK.\n\nQuestioned by the BBC on whether the government has lost control of High Streets to Kurdish organised crime gangs, Home Secretary Shabana Mahmood said: \"What your reporters were able to scrutinise and show is absolutely evidence of why our system is broken.\n\n\"It's why this government has been cracking down on illegal working.\"\n\nIn one of the investigations, an undercover reporter posed as a mini mart owner who had received a fine from immigration enforcement worth up to £60,000 for employing illegal workers, and met with Zohaib Hussain.\n\nDuring the meeting at a solicitor's in Huddersfield, Mr Hussain fired questions at our reporter about his cover story.\n\n\"How many illegal workers? So how much is the fine? How many times did they catch you?\"\n\nThen, with a chuckle, he asked what was sold in the mini-mart: \"Do you sell vapes? Legal or illegal? Bit of both as well?\"\n\nMr Hussain went on to explain how to avoid the fine. He said: \"Sometimes we might have to make documents,\" said Mr Hussain, such as \"business agreements\".\n\nOur undercover reporter then asked if the fine would be transferred to someone else's name. Mr Hussain said that would be \"the last resort.\"\n\nBefore the meeting ended, Mr Hussain warned that the immigration authorities would want to jump on the fine straight away - making a cutting-motion across his throat.\n\nHe said his charges would be £3,500 and he \"would look after us\".\n\nDuring the whole meeting with Mr Hussain, a man known as Shaxawan was present in the room.\n\nShaxawan was revealed by the BBC as a man at the centre of an organised crime network involved in the facilitation of illegal working.\n\nHe told undercover journalists that he and his associates could help migrants - including asylum seekers - to set up businesses illegally and \"confuse\" immigration enforcement.\n\nIn Companies House listings, Shaxawan is named as Kardos Mateen, a British resident in his 30s, and has been the director of 18 businesses across the north of England, including many High Street mini marts.",
      "category": "economy",
      "source": "BBC News",
      "link": "https://www.bbc.com/news/articles/cq50n5pd2ejo",
      "date": "2025-11-18"
    },
    {
      "id": "199d",
      "title": "So long, plastic wet wipes - but should we be flushing the new ones?",
      "description": "Water companies say wet wipes containing plastic are one of the main causes of blockages in their pipes.",
      "body": "So long, plastic wet wipes - but should we be flushing the new ones?\n\n1 day ago Share Save Jonah Fisher Environment correspondent Share Save\n\nJonah Fisher/BBC Grant Mitchell from Severn Trent Water says every day 10 tonnes of wet wipes is removed from sewage at Minworth Wastewater Treatment works\n\nLong the scourge of water companies for blocking pipes, a ban on the sale of wet wipes made of plastic has been signed into law. The new rules will come into force in 2027 and will bring England into line with legislation across the rest of the UK. Plastic wipes don't disintegrate when flushed down the toilet, so when oil and fat congeal on them, so-called fatbergs form in sewers, which water companies say cost them £200m a year to clear. Most of the wipes that are sold in the UK are now made of non-plastic materials but the government and water companies say they should not be labelled as \"flushable\" because they can still cause blockages.\n\nThe wet wipe manufacturers contacted by the BBC said their non-plastic \"flushable\" wipes have been thoroughly tested and comply with all the rules.\n\nPA Media Last month, this massive fatberg was removed from a sewer in west London - it weighed 100 tonnes, Thames Water said\n\nFatbergs can become huge if the blockage is not cleared. Just last month a massive stinking lump of wet wipes, fat and oil was removed from a west London sewer. It weighed the same as eight double-decker buses and took a specialist team more than a month to break down. The market for wet wipes has been growing steadily for years. According to government figures in 2023, 32 billion wipes were sold to UK consumers of which about 12 billion contained plastic. If they were all laid out flat that's enough to cover 2,200 football pitches with plastic wipes. Though they welcomed the new legislation for England, water industry sources were also quick to point out its limitations. UK companies will still be able to manufacture and export plastic wet wipes, and they will still be available for people to buy from pharmacies both in person (behind the counter) and online. Businesses like hotels will be allowed to buy the wipes, without restrictions. The medical profession successfully argued for an exemption from the wet wipe ban, arguing that non-plastic wipes absorb too much of the detergents and disinfectants impregnated in them, with potential consequences for patient safety.\n\nWhere your wet wipes end up when you flush them\n\nAt Minworth Wastewater Treatment works in the Midlands the scale of the current problem can be both seen and smelt. Minworth serves a population of more than two million people across Birmingham and the Black Country and Severn Trent, who run the facility, say 10 tonnes a day of wet wipes end up here. \"It's a nightmare,\" Grant Mitchell, Severn Trent's head of blockages says, as we survey a small mountain of wipes. He's just shown us the area where the \"un-flushables\" are filtered out from the sewage. It's grotty stuff. There are dead rats, a rubber duck as well as a huge ball of soiled wipes. \"Wet wipes are a problem because they're made to not break down like toilet paper,\" he says. \"So they stay in one piece, and they gather together with fat, oil, and grease from kitchens, congeal and create a fatberg which causes flooding.\" Also on hand at Minworth is Emma Hardy the Minister for Water and Flooding. \"It's going to make a huge difference,\" Emma Hardy, the Minister for Water and Flooding, said of the ban as we sheltered from the rain at Minworth. \"I think people maybe underestimate the amount of problems that these wet wipes cause.\"\n\nDaniel Jolly/University of East Anglia Daniel Jolly from the University of East Anglia has been researching how quickly biodegradable wipes breakdown\n\nWhile many brands say their wipes are \"flushable\" and environmentally friendly, whether they can and should be disposed of down the toilet is being questioned. Daniel Jolly is researching how fast these biodegradable wet wipes break down. In a lab at the University of East Anglia in Norwich we watch as he simulates what a toilet flush does to a wipe. \"This isn't toilet paper\" he says as the wipe slowly breaks apart into fibres while he stirs the water inside an tank. \"Even though it's the same basic materials, this is built completely differently and it's much stronger.\" Jolly has been carrying out tests on the banks of the River Yare to see how quickly the plastic-free wipes disintegrate. \"It's a period of most likely months to a year, or two years, depending on the environmental conditions that they're in,\" he says. \"That's much slower than toilet paper which is between weeks to several months, but much better than a plastic wipe which can last hundreds, even thousands of years in certain situations.\" Research commissioned by the government found that some non-plastic wipes failed tests on how fast they disintegrated, meaning they could still block sewers. Jolly is now looking at what impact the biodegradable wipes have on aquatic life as they fall apart.\n\nJonah Fisher/BBC Many non-plastic wipes are now marketed as \"flushable\", but the government and water companies say they should be thrown in the bin after use\n\nUntil March 2024 the water companies ran a certification scheme which gave the green light for some wipes to be put in the toilet, called \"Fine to Flush\". But that was discontinued because of fears it was causing confusion among consumers and replaced with a new slogan \"Bin the Wipe\". Now the advice from the government and the water companies is very clear. Only the three P's - pee, paper and poo should be put down the toilet. \"Restricting the sale of wet wipes containing plastic is a step in the right direction,\" said a spokesperson for Water UK, the industry's trade body. \"But we really need a ban on their manufacture and mandatory 'do not flush' labelling on all wet wipes.\" Some of the manufacturers who market \"flushable\" wipes told the BBC that they were in fact moist toilet tissues, but Water UK said it still viewed them as wet wipes so they shouldn't be flushed. \"I would encourage them [the wet wipe manufacturers] to show leadership on this right now,\" says Minister Hardy. \"Instead of marketing them as being flushable, provide labelling to inform the public that they need to bin them and not flush them down the toilets.\"",
      "category": "technology",
      "source": "BBC News",
      "link": "https://www.bbc.com/news/articles/cdjr4gk7v38o",
      "date": "2025-11-18"
    },
    {
      "id": "245d",
      "title": "The Prints Of Peace",
      "description": "It's incredibly silly to think that we have been at this - whatever this is - for twenty-seven years. That is a crazy thing to do for as long as we've been doing it. Any rational actor would have boarded the white ships aeons ago, as men reckon time. From thi…",
      "body": "It's incredibly silly to think that we have been at this - whatever this is - for twenty-seven years. That is a crazy thing to do for as long as we've been doing it. Any rational actor would have boarded the white ships aeons ago, as men reckon time. From this throne in the ATL, Ludacris calls upon all of us to - in his words - \" Act A Fool .\" But he could never have imagined this kind of foolishness extended over such a substantial period of time.\n\nIt's utterly nonsensical. As suggested in the (meryl) streep, so many assumptions of the previous era have just boiled away. It was at the point where we'd go to GameStop and they wouldn't carry PC software unless you preordered it, and now the cumulative effect of Steam's power is that the maker of Half-Life, which was, y'know… a cool game, is now synonymous with gaming on computers.\n\nIndeed, it's so much the same thing that they made a machine that will send your games to their other machine so you can play them on your face. The PC has now been identified as a growth opportunity for Sony and Square Enix at the moment Valve is ready to offer a curated end-run around Windows.\n\nPlaying hot new shit on Linux used to mean buying games from a developer who shared your sicko, freak-a-leak tastes or waiting for somebody to crunch the numbers on a port - a real Mac Gaming moment. Can you even imagine their joy, at this stage? Their pleasure? Their vindication? I'd say \"I certainly can't,\" but I have a Steam Deck - this particular call is coming from inside the house. It just gets weirder and weirder from there. Imagine somebody who has primarily been hitched to a PlayStation parsing their first Steam Sale. Presumably, they just catch on fire.\n\nIt has never once stopped being interesting for almost thirty years, and with Sony, Valve, and Microsoft all essentially standardizing on AMD and nVidia way up its own ass it's hard not to wonder if there's something tectonic under all that. It's been incredibly fun to think about all this stuff all these years, and I'm glad you're here with us.\n\n(CW)TB out.",
      "category": "entertainment",
      "source": "Penny-arcade.com",
      "link": "https://www.penny-arcade.com/news/post/2025/11/18/the-prints-of-peace",
      "date": "2025-11-18"
    },
    {
      "id": "d7ff",
      "title": "Apple loses iPhone Air designer to unnamed AI startup",
      "description": "Bloomberg reports that Abidur Chowdhury, the industrial designer who introduced the iPhone Air during Apple’s September event, has left for an unnamed artificial intelligence startup. Here are the details. more…",
      "body": "Bloomberg reports that Abidur Chowdhury, the industrial designer who introduced the iPhone Air during Apple’s September event, has left for an unnamed artificial intelligence startup. Here are the details.\n\nApple’s brain drain continues beyond its AI research division\n\nApple has been facing a relentless brain drain from its AI departments, with recent departures including top engineers and researchers who have defected to companies such as Meta, Anthropic, and OpenAI.\n\nBut in the design division, Apple has also been suffering its own wave of departures, particularly to Jony Ive’s team at io, which was acquired earlier this year by OpenAI.\n\nThat includes Evans Hankey, who succeeded Ive as industrial design lead following his departure, Tang Tan, who spent more than 25 years working on design at Apple, Cyrus Daniel, who worked at Apple’s human interface design team for 15 years, Matt Theobald, who worked on manufacturing design at Apple for almost 20 years, Erik de Jong, who partly led the Apple Watch design team.\n\nNow, as reported by Bloomberg, Chowdhury has also left Apple:\n\n“Abidur Chowdhury, an industrial designer, recently departed the iPhone maker for an artificial intelligence startup, according to people familiar with the move. His exit made waves internally, given his rising profile within the design team, said the people, who asked not to be identified because the matter is private.”\n\nBloomberg’s report does not mention where Chowdhury moved to, and his LinkedIn profile still shows Apple as his current employer.\n\nThe report does mention, however, that although he “played a key role in developing the iPhone Air,” his departure is “unrelated to the debut of the phone.”\n\nYou can watch Chowdhury’s introduction of the iPhone Air below:\n\nWhat’s your take on Chowdhury’s departure? Let us know in the comments.\n\nAccessory deals on Amazon",
      "category": "technology",
      "source": "9to5Mac",
      "link": "https://9to5mac.com/2025/11/17/iphone-air-designer-leaves-apple-for-ai-startup/",
      "date": "2025-11-18"
    },
    {
      "id": "8ad2",
      "title": "OK, for real though, what's the chance of a Half-Life 3 announcement happening soon? Here's what we know",
      "description": "Plus, let us know how likely you think a new Half-Life is in our reader polls.",
      "body": "After two decades of Half-Life 3 rumors, each new burst of hope looks a lot like Charlie Brown once again getting set to kick a football. None of the suspicious lines of CS:GO code or yarn-webbed conspiracy board YouTube videos have actually preceded an announcement of the fabled Half-Life 2 sequel. And yet, here we all are again, charging down the field with renewed gusto following Valve's big hardware announcements.\n\nGiven how many times we've ended up flat on our backs behind an unkicked football, I cringe to say this, but it's not unreasonable to believe that a new Half-Life game will be announced within the next year or so. The recent excitement on the Half-Life subreddit is partially due to misunderstandings (reporter Jason Schreier does not in fact have insider information about an imminent announcement), but is at least somewhat justified by the facts:\n\nThe idea that Valve might release a new Half-Life game is no longer in the realm of pure imagination, as it put out the VR-only Half-Life: Alyx in 2020\n\nThe Half-Life: Alyx ending (spoilers) very much leaves the door open for future Half-Life games\n\nFive years is enough time to have made a new Half-Life game (although barely, these days), or at least gotten far enough into development to announce it\n\nValve just announced new hardware, and new hardware also preceded the announcement of Half-Life: Alyx\n\nValve made a big deal of Half-Life 2's recent 20th anniversary, and very lightly teased a future for the series\n\nBefore we get to my prediction, let's hear what you think: You'll find a couple of reader polls below, the first on the probability that Valve will announce any Half-Life game within a year, and the second asking whether Valve will specifically announce Half-Life 3. Let us know in the comments how you voted!\n\nReader polls\n\nMy take\n\nThere's probably a Half-Life game in development, but I'm not confident we'll hear about it soon\n\nBased purely on my own speculation, I think Valve is making a new Half-Life game, and I'd put the chance of it being announced within the next year at 25%. I'm less confident that it'll actually be called Half-Life 3 (I'll say 10% for that), but the Half-Life: Alyx ending does pretty clearly set the stage for a new main-series Half-Life game. (If you haven't played it, you can spoil it for yourself here.)\n\nOne reason I'm not more confident we'll get a Half-Life announcement in the near future is that Gabe Newell said in the Half-Life 2 anniversary documentary that Valve never finished Episode 3 because he couldn't figure out how it was \"pushing anything forward.\" In other words, new Half-Life games have to be groundbreaking in some way, not just a continuation of the story.\n\nFor Half-Life: Alyx, the exciting new thing was VR (as well as cool bottles), but I can't figure out what technology or game design idea the next Half-Life will revolve around. Valve has another VR headset on the way, but two VR Half-Lifes in a row would really test the patience of all the Half-Life fans who aren't interested in VR.\n\nA new Half-Life to bundle with the new Steam Machines is a possibility, but again, I'm not sure what the big innovation would be. I'd applaud the boldness if Valve made it a Linux exclusive, but that seems unlikely. Also unlikely is anything to do with generative AI—Valve hasn't said much about it, except to make Steam games disclose when they've used it.\n\nThe biggest gaming news, reviews and hardware deals Keep up to date with the most important stories and the best deals, as picked by the PC Gamer team. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nPerhaps Valve will surprise us and release a new Portal game instead, or some other Half-Life universe spinoff. An important part of Half-Life lore that's still to be explored involves a mysterious ship called the Borealis, and Newell's lately been filling his time with genuine deep sea exploration—just sayin'.\n\n(He's also got a neuroscience company making brain chips, so maybe Half-Life 3 will just be the establishment of an actual Aperture Science.)",
      "category": "technology",
      "source": "PC Gamer",
      "link": "https://www.pcgamer.com/games/fps/half-life-3-rumors-poll-2025/",
      "date": "2025-11-18"
    },
    {
      "id": "ad04",
      "title": "【お口の恋人】ロッテのチョコパイに歯が混入・・・",
      "description": "1: ソリブジン(みょ) [US] 2025/11/14(金) 17:06:19.02 ID:HiPceLyr0 BE:595582602-2BP(5555) sssp://img.5ch.net/ico/anime_shii03.gif ロッテ「チョコパイ」に歯が混入？ 投稿拡散で波紋…同社は「原因を特定できず」と回答 https://news.yahoo.co.jp/articles/c286a90...",
      "body": "1: ソリブジン(みょ) [US] 2025/11/14(金) 17:06:19.02 ID:HiPceLyr0 BE:595582602-2BP(5555) sssp://img.5ch.net/ico/anime_shii03.gif ロッテ「チョコパイ」に歯が混入？ 投稿拡散で波紋…同社は「原因を特定できず」と回答 https://news.yahoo.co.jp/articles/c286a90...",
      "category": "international",
      "source": "Livedoor.biz",
      "link": "https://news4vip.livedoor.biz/archives/52566780.html",
      "date": "2025-11-18"
    },
    {
      "id": "01d0",
      "title": "Introducing the j-metric: a true measure of what matters in academia",
      "description": "Science has become obsessed with publishing numbers. With this new satirical proposal, have we reached peak metric?",
      "body": "Dariusz Jemielniak is Vice-President of the Polish Academy of Sciences, faculty associate at the Berkman Klein Center for Internet and Society at Harvard University, and Professor at Kozminski University.\n\nScience has become obsessed with publishing numbers. With this new satirical proposal, have we reached peak metric?\n\nCredit: Adapted from Getty\n\nMore than half a century ago, information scientist Derek De Solla Price observed that the scientific literature was growing exponentially, doubling every 10–15 years1. Little did he know that this observation would spawn not just a field of study, but an entire industry devoted to counting, measuring, weighing and indexing every aspect of academic output2. Today, the modern academic doesn’t just publish — they generate metrics. They don’t just research — they optimize their h-indices. And they certainly don’t just think up new ideas — they maximize citation counts while maintaining a favourable paper output.\n\nUltimately, they produce ‘units of assessment’, according to the UK Research Assessment Framework (REF), which the United Kingdom uses to allocate £2 billion (US$2.7 billion) in public research funding across its universities. They don’t collaborate; they strategically co-author, to maximize citation networks. And they certainly don’t read any more — who has time when there are metrics to massage?\n\nThe rise of the h-index: when counting became culture\n\nIt began innocently enough. Twenty years ago, physicist Jorge Hirsch at the University of California, San Diego, proposed the h-index. It was elegantly simple: a scholar with an h-index of n has published n papers that have each been cited at least n times3. Hirsch’s original paper suggested that “for physics, a value for h of about 10–12 might be a useful guideline for tenure decisions at major research universities”.\n\nOh, sweet summer child, to quote a popular line from Game of Thrones.\n\nWhat Hirsch had unleashed was not merely a metric, but a compulsion. Within a decade, the h-index had metastasized across disciplines. And very quickly, rather than a metric, it became a target. Search committees began sorting candidates by h-index; promotion committees set h-index thresholds; graduate students started checking their h-indices with the frequency and anxiety typically reserved for checking a dating app.\n\nAn explosion of metrics\n\nBut why stop at one number when you could have dozens? The h-index begat the g-index (which gives more weight to highly cited articles)4, which begat the e-index (to account for citations beyond those considered in the h-index), the a-index (to measure the average number of citations in a researcher’s top papers) and the m-index (which takes career length into account). There is now the i10-index (the number of publications with at least ten citations), the h-core (the core set of papers considered by the h-index) and the contemporary h-index (which adds a decay function, because apparently citations should have a half-life).\n\nEach new metric arrived with its own justification, its own formula and its own promise to finally capture the true essence of scholarly impact.\n\nTo me, metrics are like trying to measure the ocean by counting waves, each new metric promising to quantify them more accurately than the last. The REF, for example, gave us ‘impact case studies’ — documents that describe research impact beyond academia. Australia’s Excellence in Research for Australia (ERA) introduced ‘research quality indicators’ to assess research quality across disciplines. The Leiden Manifesto5 actually had to remind us that “quantitative evaluation should support qualitative, expert assessment” — a bit like reminding people that food should be chewed before swallowing. Naturally, these metrics are justified as ensuring accountability to taxpayers, who surely lie awake at night wondering about h-indices rather than, say, whether scientists have cured cancer or explained consciousness.\n\nMeanwhile, the publishers watched and learnt. We now have a panopticon of productivity, in which every citation is counted, every self-citation scrutinized and every collaboration strategically calculated for maximum metric optimization.\n\nEnter the j-index: the weight of true scholarship\n\nI humbly propose a new, maybe-slightly-ironic, metric. This captures what truly matters in academic work: physical heft. I call it the j-index, and its calculation is refreshingly straightforward:\n\nJ = W ÷ Y\n\nWhere W is the total weight (in kilograms) of all books a scientist has authored, and Y is the number of years since the author earned their doctorate.\n\nConsider the elegant simplicity. No longer must we worry about citation cartels (in which authors cite each others’ publications to boost citation counts) or gaming the system through self-citation. The j-index is immune to such manipulation — unless the books are printed on heavy paper stock, which should be discouraged through strict guidelines on acceptable paper weights. On the plus side, no longer will scholars insist on softcover editions: just think how many trees we can save!\n\nThe j-index recognizes what we all know but seldom acknowledge: that real scholarship has weight. A monograph from Princeton University Press, with its dignified heft and substantial footnotes, should surely count for more than a dozen lightweight articles scattered like academic confetti across various journals. The scholar who produces a steady stream of weighty tomes demonstrates not just intellectual capacity, but physical stamina — hauling those manuscripts to the publisher is no small feat.\n\nThe j-index also solves the perpetual problem of comparisons across disciplines. No longer need we wrestle with the fact that computer scientists cite differently from historians, or that medical researchers publish in teams whereas philosophers toil in solitude. A kilogram of philosophy weighs the same as a kilogram of physics.\n\nThe deeper malaise: when everything that counts must be counted\n\nThe result of an obsession with metrics is that we’ve standardized scholarship to the point at which a publication is a publication is a publication, regardless of whether it represents years of archival research or a weekend’s worth of data massage. As academia becomes McDonaldized — subject to the fast-food industry principles of efficiency, calculability, predictability and control — one phrase becomes relevant: ‘Do you want cites with that?’\n\nGaming in academic publishing takes many forms, including citation cartels and reviewer rings, in which people review each other works favourably to advance each others’ careers, and other schemes to manipulate metrics. We’ve created a system so focused on counting that it has inadvertently incentivized corruption.\n\nIt's reminiscent of the urban legend of Soviet factory that, when given a quota in tonnes, produced a single, massive nail. We get what we measure, and what we’re measuring is measuring itself.",
      "category": "politics",
      "source": "Nature.com",
      "link": "https://www.nature.com/articles/d41586-025-03349-1",
      "date": "2025-11-18"
    },
    {
      "id": "ebd3",
      "title": "The UK must not lose its focus on science and innovation",
      "description": "An ambitious plan to create a trillion-dollar technology company comes with risks.",
      "body": "Shoreditch in east London is a hub for technology companies and vibrant street art.Credit: Kathy DeWitt/Alamy\n\nPeople who have lived and worked in the east London neighbourhood of Shoreditch might recall a time when they had to contend with periodic police roadblocks and the whirring sound of helicopters. This was after 2010, when David Cameron became prime minister, and started visiting the area. Cameron and his team were lured by an ecosystem of technology companies in a part of the city known for its vibrant street art and playfully called Silicon Roundabout. These companies included relative newcomers such as Mind Candy, which made Moshi Monsters — a children’s computer game — as well as more mature companies such as maritime satellite giant Inmarsat. Shoreditch is where Cameron and his travelling entourage thought that they would find the United Kingdom’s answer to Google or Facebook. Fast-forward 15 years, and the country still seems to be chasing — but not yet realizing — its dream of an economy fuelled by a bigger and more dynamic technology sector.\n\nCan UK science really spawn a $1-trillion company?\n\nThat’s not to downplay the successes. The United Kingdom is ranked fourth in the world (behind the United States, China and India) for its number of tech unicorns — start-up companies that are now valued at more than US$1 billion but are not publicly listed. Most of these are in London and the southeast of England. But the United Kingdom lacks companies the size of US technology giants such as NVIDIA (valued at $5 trillion), Apple, Microsoft (each valued at $4 trillion) or Alphabet (the parent holding company of Google worth $3.3 trillion).\n\nThe UK government wants to create its first trillion-dollar tech company by 2035. As Nature’s news team reports, not everyone thinks that this is the right target for stimulating economic growth (see Nature https://doi.org/qd39; 2025). As the winners of this year’s Nobel prize in economic science demonstrated, smaller companies are more likely to bring new, disruptive technologies to market than are bigger firms. When large companies get even bigger they tend to want to consolidate their presence, and they do this partly by absorbing smaller, innovative, high-growth companies — as most of today’s tech giants have done. Lawmakers in both Europe and the United States are examining whether some of the biggest tech companies are engaging in anti-competitive practices to maintain dominance. There are some studies that suggest that when large companies break up, it unleashes innovation (R. Showalter and L. Edelson Univ. Chicago Bus. Law Rev. 4.1, 143–188; 2025).\n\nEconomics Nobel prize won by researchers who showed how science boosts growth\n\nStill, there is no doubt that governments view the biggest companies as signs of national economic strength. In the United Kingdom, parliamentarians are worried that the country is struggling to hold on to both its biggest and its most innovative corporations. DeepMind, a pioneering artificial-intelligence firm based in London, was sold to US-based Google in 2014. In 2016, the Japanese investment and technology giant Softbank in Tokyo bought chip-designer ARM, which is based in Cambridge, UK. On 3 November, shareholders of pharmaceutical giant AstraZeneca based in Cambridge (worth $276 billion) approved a listing on the New York Stock Exchange. At the same time, AstraZeneca has scaled back planned expansions of research and vaccine facilities in the United Kingdom.\n\nOn 5 November, the UK House of Lords published a report that warns of the threat to growth posed by science-based firms leaving the country, and the nation’s failure to scale up more home-grown companies (see go.nature.com/4r2rwsp). The report makes several recommendations, including providing universities with consistent and sustainable funding and immigration policies that attract the brightest and best researchers and students, no matter where they were born.\n\nThe report also says that, although the United Kingdom is good at creating companies, these firms lack access to the finances that would help them go to the next level. It recommends that pension funds invest more in high-growth technology companies that have the potential to scale up. Another suggestion is to create a top-level government committee with a laser-like focus on scaling up companies. It would be chaired by the prime minister and meet frequently to coordinate action across government.\n\nPharmaceutical giants pull out of UK: why it matters for global science\n\nThese suggestions — from witnesses who gave evidence for the report — do not necessarily reflect a consensus of the available research on the topic. Pension funds, for example, would provide a welcome injection of capital, but it’s not clear whether a lack of funding from this source is currently holding UK companies back. And, although a high-level committee would certainly put the issue of a trillion-dollar company high on the government’s agenda, such planned government involvement is not generally the key driver of company expansion, at least in the modern age. The other unknown that surrounds this idea is whether such a committee would survive a change of government.\n\nThat being said, the attention that science, technology, innovation and prosperity are receiving in the United Kingdom is welcomed. Indeed, every country needs to be actively thinking about how to successfully harness science to fuel innovation. It will result in well-funded universities that encourage and nurture curious minds; policies that reward research and entrepreneurship; and injections of capital at various stages of company formation, from start-ups to giants. It will mean breaking the cycle of focus on short-term results.\n\nSilicon Roundabout’s light has faded. The area is no longer a focus for top ministers. Its story offers a valuable lesson for today: policymakers’ focus on innovation shouldn’t be ‘here today, gone tomorrow’. They need to be committed for the long term.",
      "category": "economy",
      "source": "Nature.com",
      "link": "https://www.nature.com/articles/d41586-025-03757-3",
      "date": "2025-11-18"
    },
    {
      "id": "4156",
      "title": "'She picked us before we picked her': A meowing yard-day visitor curls up in a lap, wins over two humans, and ends up finding the loving forever home she’d been waiting for all along",
      "description": "When a sweet little cat wandered up during a day of yard work, this couple assumed she belonged to someone nearby. She was friendly, fearless around lawn equipment, and more than happy to curl up in a warm lap. They thought she'd head home eventually. Instead…",
      "body": "'You need to NOT reward her misbehaving': New cat owner realizes her cat is tricking her into being fed more by trying to eat inedible things, owner worries about her health but kind strangers lead her in the right direction",
      "category": "technology",
      "source": "Cheezburger.com",
      "link": "https://cheezburger.com/43251461/she-picked-us-before-we-picked-her-a-meowing-yard-day-visitor-curls-up-in-a-lap-wins-over-two-humans",
      "date": "2025-11-18"
    },
    {
      "id": "7b68",
      "title": "Excited for Stranger Things season 5? I’ve found an easy way to get a free Netflix subscription just in time for the premiere",
      "description": "Here's a great way to get a free Netflix subscription ahead of the Stranger Things season 5 premiere.",
      "body": "Stranger Things season 5 is just days away, with Volume 1 arriving on Netflix on November 27. If you're keen to watch the show everyone's talking about, but you don't have a subscription, there's an easy way to get one for free.\n\nIf you're a T-Mobile customer or looking to switch, the mobile network is offering its \"Netflix on Us\" perk, which entitles you to a free Netflix Standard with Ads subscription, usually priced at $7.99 per month.\n\nThanks to this perk, T-Mobile gives customers access to TV shows, movies, mobile games, and live events across any device, including a TV, computer, tablet, or phone, at no extra cost.\n\nThis freebie is valid with T-Mobile's Experience Beyond and Experience More Plans, which are priced at $100 per month or $85 per month, respectively. This covers one phone line plus taxes and fees.\n\nFor those wanting to cover a whole family, there are plans for up to five phone lines, with more information about each on the T-Mobile website.\n\nHow To Set Up Netflix on Us | T-Mobile - YouTube Watch On\n\nOn top of this, you don't have to be a new Netflix customer to take advantage of T-Mobile's deal, meaning you can swap your current plan and change to Netflix on Us instead.\n\nOver on their FAQs page, T-Mobile clarified that: \"T-Mobile pays Netflix directly for you. For customers with an existing Netflix account, it may take one or two Netflix billing cycles for your billing to transfer to T-Mobile.\"\n\nGet daily insight, inspiration and deals in your inbox Sign up for breaking news, reviews, opinion, top tech deals, and more. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nNetflix does not offer a free trial across any of its plans, so this is a great way to enjoy the best Netflix shows and the best Netflix movies for less.\n\nIt's not just Netflix either, as I was impressed to learn that the Experience More and Experience Beyond plans also offer Hulu on Us and Apple TV on Us, so that's three of the best streaming services you can enjoy with your mobile plan.\n\nThis is well worth taking advantage of if you're keen to make the most of your mobile plan, and it's perfect timing ahead of the highly anticipated return of Stranger Things.\n\nFollow TechRadar on Google News and add us as a preferred source to get our expert news, reviews, and opinion in your feeds. Make sure to click the Follow button!\n\nAnd of course you can also follow TechRadar on TikTok for news, reviews, unboxings in video form, and get regular updates from us on WhatsApp too.",
      "category": "international",
      "source": "TechRadar",
      "link": "https://www.techradar.com/streaming/netflix/excited-for-stranger-things-season-5-ive-found-an-easy-way-to-get-a-free-netflix-subscription-just-in-time-for-the-premiere",
      "date": "2025-11-18"
    },
    {
      "id": "e201",
      "title": "Bill Gates’s climate comments are a dangerous distraction",
      "description": "People do not have to dismiss or exaggerate the climate threat to justify concerted action.",
      "body": "Michael E. Mann is a professor at and director of the Penn Center for Science, Sustainability, and the Media at the University of Pennsylvania in Philadelphia.\n\nPeople do not have to dismiss or exaggerate the climate threat to justify concerted action.\n\nFifteen years ago, my friend and mentor, climate scientist Stephen Schneider, said something that has stuck with me. When it comes to climate change, the “end of the world” and “good for you” are “the two lowest-probability outcomes”.\n\nExtreme heat harms health — what is the human body’s limit?\n\nSteve’s aphorism feels especially prescient today. As the 30th United Nations Climate Change Conference (COP30) plays out in Belém, Brazil, this month, misleading climate messaging in the media espouses both these extremes.\n\nAt one end, take the actions of billionaire philanthropist Bill Gates. On 28 October, he astounded climate advocates by publishing a manifesto arguing that the climate crisis is less urgent than other major problems that humanity faces (see go.nature.com/23xed). Jarringly, its publication coincided with the devastating Jamaican landfall of potentially the strongest Atlantic hurricane on record, an event that human-caused warming made more likely to happen.\n\nGates wasn’t implying that global warming is “good for you”, but his arguments are adjacent to that sentiment: there has already been enough progress on climate, and we should instead prioritize addressing what he feels are more pressing issues, such as poverty and disease.\n\nDespite substantial criticism from me and other climate specialists that this presented a false trade-off between climate action and public health, Gates dug in his heels. “What world do they live in?” he said in an interview with the news outlet Axios, telling reporters that he would “let the temperature go up 0.1 degree to get rid of malaria”.\n\nClimate change is also a health crisis — these 3 graphics explain why\n\nIndeed, what world is Gates living in? The idea that climate action must come at the expense of efforts to address human health is a provable fallacy. In our book Science Under Siege (2025), public-health scientist Peter Hotez at Baylor College of Medicine in Houston, Texas, and I detail how these challenges are, in fact, inseparable. Human-caused climate change will exacerbate pandemics, as it did for COVID-19, and vector-borne diseases, such as malaria. How Gates or anyone else proposes to “get rid of malaria” in a rapidly warming world is anyone’s guess. This is a strawman argument.\n\nGates’ pivot has been celebrated by climate-change downplayers and fossil-fuel proponents in politics, including US President Donald Trump, and in segments of the media, including the newspapers The Wall Street Journal and New York Post — even if Gates has disavowed their characterizations of his position.\n\nMeanwhile, those at the opposite ‘end of the world’ extreme are hardly any more helpful. “It may be too late” announced Robert Hunziker, a freelance writer in Los Angeles, California, just one month ago on the news site Counterpunch. Such narratives of doom are often reinforced by media outlets that overstate the dire nature of the impacts that are baked in, with breathless headlines about supposed tipping points that have already been crossed. This feeds a collective sense of hopelessness.\n\nWhy we still don’t know the mounting health risks of climate change\n\nI have long been critical of this sort of climate doomism: it could lead humanity down the same path as outright denial. After all, if it’s too late to act, then why act at all? We have even seen doomism increasingly weaponized against climate action — depicting it as a hopeless cause. One example is petrostates such as Saudi Arabia and Russia, which have long lobbied against global climate agreements. Regrettably, they are now joined by the United States under Trump.\n\nHumanity has made progress toward decarbonizing societal infrastructure — but not nearly enough. Current agreements are wholly inadequate to limit warming to below dangerous levels. Current policies will lead to roughly 3 °C of warming, and backsliding of the sort we’re now seeing — for example, by the world’s largest historical polluter, the United States — could plausibly result in 4–5 °C of warming of the planet by the end of the century (C. R. Schwalm et al. Proc. Natl Acad. Sci. USA 117, 19656–19657; 2020).\n\nThat’s enough warming to place our ‘planet on the brink’, to quote the title of a peer-reviewed assessment by me and more than a dozen other leading climate researchers, published the day after Gates’s memo (W. J. Ripple et al. Bioscience https://doi.org/qd3w; 2025). That report finds that 22 of 34 of “the planet’s vital signs are flashing red”.\n\nYet, the best available climate science suggests that it is not too late. The obstacles to limiting warming to below ever-more-dangerous levels remain political, rather than physical or technological.\n\nStates now have a legal duty to prevent climate harm — justice is in reach\n\nAs I’m fond of saying, we must communicate both the urgency and the agency. As Schneider used to say: “The truth is bad enough.” We don’t have to exaggerate the threat to justify concerted action.\n\nAt the COP30 opening, UN secretary-general António Guterres issued a stark condemnation of the policymakers there who “remain captive to the fossil-fuel interests, rather than protecting the public interest”. Allowing warming to exceed the 1.5 °C danger level, he said, would constitute a “moral failure and deadly negligence”.\n\nPerhaps even addressing Gates himself, Guterres added that “every fraction of a degree higher means more hunger, displacement and loss”. That obviously speaks to the urgency of action. But it’s also a reminder that every fraction of a degree of warming we prevent means tremendous amounts of avoided damage. That’s the agency we hold.",
      "category": "technology",
      "source": "Nature.com",
      "link": "https://www.nature.com/articles/d41586-025-03712-2",
      "date": "2025-11-18"
    },
    {
      "id": "728f",
      "title": "Vast Bronze Age city discovered in the plains of Kazakhstan",
      "description": "A major settlement in Central Asia called Semiyarka dating back to 1600 BC had houses, a big central building and even an industrial zone for producing copper and bronze",
      "body": "A major settlement in Central Asia called Semiyarka dating back to 1600 BC had houses, a big central building and even an industrial zone for producing copper and bronze\n\nDrone photograph of the archaeological site of Semiyarka Peter J. Brown\n\nA large 140-hectare settlement dating back 3600 years has been discovered in the plains of north-eastern Kazakhstan, transforming our understanding of life in prehistoric Eurasia. It hints that the open grasslands of Central Asia once held a Bronze Age community as connected and complex as much better-known ancient civilisations.\n\n“It’s not quite a missing piece of the jigsaw; it’s the missing half of the jigsaw,” says Barry Molloy at University College Dublin, Ireland, who wasn’t involved in the work.\n\nThe Bronze Age featured many notable civilisations, including the Shang and Zhou dynasties in China; the Babylonians and Sumerians in what is now Iraq; and numerous cultures around the Mediterranean, including the Egyptians, Minoans, Mycenaeans and Hittites.\n\nThe Central Asian steppes, however, were thought to be the domain of highly mobile communities living in tents or yurts. Semiyarka, or the “City of Seven Ravines”, seems very different and could have played a crucial role in the spread of bronze items between civilisations.\n\nThis is because the site – first identified in the early 2000s – overlooks the Irtysh river, which rises up in the Altai mountains in China, comes down onto the plains of Kazakhstan and goes all the way to the Arctic through Siberia.\n\nSubscriber-only newsletter Sign up to Our Human Story Each month, Michael Marshall unearths the latest news and ideas about ancient humans, evolution, archaeology and more. Sign up to newsletter\n\nMiljana Radivojević at University College London and her colleagues have been mapping and surveying the site since 2016. They have discovered that Semiyarka featured long banks of earth, conceivably for defence; at least 20 enclosed household compounds, probably built with mud bricks; and a central monumental building, which they suggest might have been used for rituals or governance. The types of pottery they found there indicate the site dates to around 1600 BC.\n\nCrucially, the crucibles, slag and bronze artefacts at the site indicate a large area was dedicated to the production of copper and tin bronze – an alloy that is mainly copper but contains more than 2 per cent tin.\n\nCompositionally, the elements in the slag from the crucibles correspond to tin deposits from part of the Altai mountains in east Kazakhstan about 300 kilometres away, says Radivojević.\n\nThe tin may have been brought there by people traversing the steppes or by boat along the Irtysh, or it may have been panned from the water, she says. “The Irtysh is the most important tin-bearing river in the Bronze Age of Eurasia and the flooding of the river’s flood plain that was happening seasonally would have been very helpful for panning the tin.”\n\nThe large size and neat lines of Semiyarka are very different from what is seen in the scattered camps and small villages usually associated with the mobile communities of the steppes.\n\nWithout detailed excavations – which are planned – we can’t know if the buildings were all there at the same time or were successive constructions over many years, says team member Dan Lawrence at Durham University, UK. “But the layout is very clear, and normally that would mean that it’s all contemporary, because you wouldn’t find these things in a neat line if they have been built one after the other.”\n\nDue to its position on the river near major copper and tin deposits, the researchers suggest Semiyarka wasn’t only a production hub for bronze, but also a centre of exchange and regional power, a key node in the vast Bronze Age metal networks linking Central Asia with the rest of the continent.\n\n“The Irtysh river was a very busy transport corridor,” says Lawrence. “It is basically laying the foundations for the Silk Roads as we know them today, a kind of pre-modern globalisation.”\n\nThe site transforms our understanding of Bronze Age steppe societies, says Radivojević, showing that they were just as sophisticated as other contemporaneous civilisations.\n\n“This tells us that they were organised, that they were capable of resourcing and defending,” says Molloy. “Bringing materials like ores and metals to a centralised space speaks of a level of social organisation that goes beyond immediately local, and it fits back into the wider networks that we know were crisscrossing Eurasia, where metals were moving and they’re the key connector in terms of those wider networks.”",
      "category": "technology",
      "source": "New Scientist",
      "link": "https://www.newscientist.com/article/2504671-vast-bronze-age-city-discovered-in-the-plains-of-kazakhstan/",
      "date": "2025-11-18"
    },
    {
      "id": "ef37",
      "title": "AI has a democracy problem — here’s why",
      "description": "A thorough examination of artificial intelligence’s promise in politics rests on a thorny premise: democracy is an information system.",
      "body": "Rewiring Democracy: How AI Will Transform Our Politics, Government, and Citizenship Bruce Schneier and Nathan E. Sanders MIT Press (2025)\n\nThe tsunami of writing on artificial intelligence tends towards either bald hype or panicked dystopianism. Proponents say that AI will revolutionize health care, drive business growth and become our new best friend. But for its critics, AI could cause massive unemployment, perpetuate fake news and pose an extinction risk to humankind.\n\nWhy an overreliance on AI-driven modelling is bad for science\n\nIn Rewiring Democracy, cybersecurity expert Bruce Schneier and data scientist Nathan Sanders offer a welcome middle path by focusing on practical politics. In a heartfelt, if workmanlike, way, they craft a framework for maximizing the democratic potential of AI. Yet, by shrinking and distorting the vexing political challenges that the world faces today to fit a single solution — AI — they short-change the frustrating glories of living together as human beings.\n\nStructured clearly enough, even for readers who know little about AI, the book is rich with concrete examples and absorbing speculation. Schneier and Sanders propose that every aspect of democratic governance — such as negotiating procurement contracts, drafting legal briefs, producing local news or facilitating conversation across political divides — could be enhanced by the thoughtful application of AI developed under public control for public benefit.\n\n“Entrenched elected officials, political movements with authoritarian tendencies, and the billionaire class all regard AI as a new tool to consolidate and centralize power,” they write. “But the rest of us, the public, can harness it as a tool to distribute power instead.”\n\nFor example, a personal “army of AI minions” could extend individual power by making it easier to speak out. AI agents could make political decisions on our behalf, guessing our preferences on the basis of past behaviour and communicating them swiftly to legislators.\n\nAI for the people\n\nAI, the authors write, could either enrich or undercut different modes of political participation: campaigns, legislation, public administration, courts, organizing and advocacy. AI as is, designed by corporate players and supercharging an already unequal political system, might exacerbate discrimination and harm, allow lobbyists to concentrate their power and leave the most vulnerable people with shoddy digital attorneys rather than pricier human ones. Public AI — designed to enrich democracy — could target government resources more effectively, lower the cost and expertise needed to generate legislation, and simplify the drafting of complaints.\n\nAI can supercharge inequality — unless the public learns to control it\n\nHowever, the democratic potential of AI will not be realized unless four conditions are met. First, the commercial AI ecosystem must be reformed, by providing robust public alternatives to technologies that are privately owned and controlled. Second, authoritarian or unethical uses of AI must be resisted by ensuring that “democratic principles … govern its development and deployment”. Third, responsible government AI must consider social impacts, weigh the risks and benefits carefully and ensure accountability. Fourth, Schneier and Sanders think, social movements could help to renovate democracy by galvanizing “their constituents to respond to the long-standing democratic threats magnified by AI”.\n\nIn the final section, Schneier and Sanders describe their vision for nurturing “robust noncorporate alternatives” to commercial tools. Imagining public AI as a “universal economic infrastructure”, like publicly run schools and highways, the authors favour multilateral, anti-monopoly regulation that might allow citizen AI to compete against the products of ‘big tech’ — an approach that the United Nations is discussing. They offer organizing principles for a shared vision of democratic AI, one that is broadly capable, widely available, transparent, meaningfully responsive, actively stripped of its biases, reasonably secure and non-exploitative.\n\nMany readers will be sympathetic to these goals. Which is why it is so disappointing that the book’s fundamental premise — that democracy can best be understood as an information system — fatally undermines those objectives.\n\nGovernment is not a machine\n\nThink of democracy “as an information system for turning individual preferences into group policy decisions, and then executing those decisions through society”, Schneier and Sanders write. But democracy isn’t a flow chart or an executable piece of computer code. Preferences are formed in the process of governance, not just counted. And as any first-year student of political science can affirm, implementation, particularly at the street level, creates, shapes and modifies policy as often as it executes it.\n\nGovernments need formal rules and copious, reliable data to function efficiently and fairly. But democracies are also human, value-laden institutions for negotiating the contradictions that come with living together well. The model of government as information system has no place for the sophistication and difficulty of what democracies attempt to accomplish, or the standards to which they are held.\n\nA system at Moscow Metro stations recognizes passengers’ faces, allowing people to board trains and make cashless payments for journeys.Credit: Andrey Rudakov/Bloomberg/Getty\n\nFor example, Schneier and Sanders argue that the purposes of democracy include “peaceful transition of power, majority rule, fair decision-making, better outcomes”. They fail to mention equally crucial aims, such as preventing tyranny, protecting minority rights, balancing conflicting values, stewarding collective wealth and nurturing human capacity.\n\nThe premise that democracy is an information system obscures the thorniest challenges that AI poses to governance. It assumes that, if everyone has equal access to reliable, accurate and timely data, our disagreements will dissolve. But we live in a world of genuinely incommensurate interests.\n\nPolicy processes don’t simply aggregate preferences, as Schneier and Sanders suggest. What’s best for the individual, or even for the majority of individuals, is not necessarily what’s best for the collective. Statistical models, no matter their sophistication, tend to default to the mean, working best for those who live under the meatiest part of the bell curve. Automated decision-making is notoriously ineffective for outliers and edge cases.\n\nChanging norms\n\nMore troublingly, the ‘democracy is an information system’ story forecloses ethical growth in human beings. Schneier and Sanders argue, for example, that the brain is a black box and that “no one can open it and examine how you reached any particular decision”. Later, they continue, “To a greater extent than humans, AIs can be studied. Their biases can be known, and — in theory at least — corrected.”\n\nUniversities are embracing AI: will students get smarter or stop thinking?\n\nThe idea that human biases are nearly impossible to understand or alter ignores vast evidence to the contrary. Although none of us is completely transparent to ourselves, every field in the humanities and social sciences rests on the assumption that human motivations can be studied, understood and even shifted. Attitudes change; societies morph; people — and nations — grow.\n\nWhether talking about race, gender and sexuality, or more mundane issues such as smoking and wearing seatbelts, norms change, sometimes surprisingly quickly. So many of the democratic challenges that people face today are in fact about social practices and cultural understandings, not laws or rules.\n\nShaping governance to align with the capacities of AI — or any technological innovation — fundamentally distorts democracy, because it discounts what is gained from the difficult, inefficient, costly, but ultimately transformative, work of human politics. Imagining an information-processing machine, Schneier and Sanders lop off pieces of the democratic project. For example, they claim that direct democracy could be improved if AI proxies could vote on our behalf without consulting us. This prioritizes outputs over the messy, but ultimately productive, processes that form political opinions and bind communities together.\n\nAI tools as science policy advisers? The potential and the pitfalls\n\nAt another moment, this might be excusable over-optimism. But where I sit in the United States, people are experiencing political attacks on federal employees, the dismantling of government programmes that identify and address bias and discrimination, the collapse of AI regulation, and an unprecedented global wave of what political scientists call ‘democratic backsliding’. In this context, the idea that democracy is an information system is not just empirically incorrect — it is dangerous.\n\nFormer US Supreme Court judge William Brennan famously argued that the dynamism of democratic institutions requires a complex “internal dialogue of reason and passion”. Logic, rules, evidence and data fertilize good governance. But passion is the soil in which democracy grows. Passion is necessary to understand the real-world impacts of government decisions on stakeholders, to affirm the essential dignity and worth of each individual, and to acknowledge our common humanity.\n\nRewiring Democracy left me feeling that, at some level, Schneier and Sanders find the human work of politics distasteful and rather grubby. But, as the writer George Orwell famously suggested in The Road to Wigan Pier (1937), “the price of liberty is not so much eternal vigilance as eternal dirt”.",
      "category": "politics",
      "source": "Nature.com",
      "link": "https://www.nature.com/articles/d41586-025-03718-w",
      "date": "2025-11-18"
    },
    {
      "id": "7a56",
      "title": "Inactivity costing £20bn a year, says Sport England",
      "description": "Funding agency Sport England says inactivity is costing £20bn a year as it calls for more investment in sport.",
      "body": "Equal access to sport and exercise could help tackle an estimated £20bn shortfall in the public finances, according to Sport England.\n\nBefore next week's Budget, the funding agency says new research highlights \"the critical role\" physical activity plays in supporting public finances and economic growth.\n\nBut it also warns inactivity is costing a \"staggering\" £20bn a year and has called for more investment in sport.\n\nIt claims that is the amount in healthcare savings, productivity gains and improved wellbeing that could be unlocked if the least active groups in society - such as those with disabilities, on lower incomes and black people - were supported.\n\nEarlier this year, Sport England found 67% of the adult population were meeting the chief medical officers' recommended guidelines, external for weekly physical activity - a record high. But it warned more needed to be done to tackle inequalities.\n\nAt the time, the government said tackling inactivity was \"at the heart of our preventative health agenda\".\n\nIn June, ministers said a minimum of £400m would be invested over the next four years into new and upgraded grassroots sports facilities, although the opposition claimed tax hikes were forcing schools to sell playing fields.\n\nSport England also says its research found grassroots sport and exercise boost the economy by £36bn every year through employment opportunities, volunteering, facilities and equipment.\n\nAnd it calculates that for every £1 invested in the sector, £4.38 is generated for people and the public purse, via savings to the NHS, chronic illness prevention, improved workforce productivity, and enhanced health and happiness.\n\nIn addition, £14bn in tax revenue is generated by grassroots sport and exercise every year: a return of approximately six to seven times the public investment in sport and exercise.\n\n\"It's shocking that inequalities in activity levels cost the public purse nearly £20bn every year,\" said the chair of Sport England, Chris Boardman.\n\n\"Inactivity is quietly draining our economy, health system and our communities - but we can change that.\n\n\"Excitingly, the solution is right in front of us: movement. With a return on investment of more than four to one, billions can be saved in healthcare, our workforce will be more productive and quality of life improved for millions.\"\n\nEarlier this month, the chancellor Rachel Reeves warned she would make \"necessary choices\" in the Budget after the \"world has thrown more challenges our way\", and did not rule out a U-turn on Labour's general election manifesto pledge not to hike income tax, VAT or National Insurance.\n\nIn June, leaders across the sport and physical activity sector jointly wrote to Prime Minister Sir Keir Starmer, warning that if they were not prioritised in government spending plans it would \"risk the decline or closure of more facilities and clubs\".\n\nThe letter was signed by organisations including the Youth Sport Trust, the Sport and Recreation Alliance, gym and leisure-centre body Ukactive and the Sport for Development Coalition.",
      "category": "economy",
      "source": "BBC News",
      "link": "https://www.bbc.com/sport/articles/cvgv2plkvz0o",
      "date": "2025-11-18"
    },
    {
      "id": "0f59",
      "title": "Beyond growth — why we need to agree on an alternative to GDP now",
      "description": "The world needs to move towards an approach to measure well-being rather than economic growth. Here’s how that can happen.",
      "body": "Gross domestic product (GDP) was never designed to be a measure of societal well-being. It tracks only market transactions, conflates costs and benefits, and ignores the distribution of income, the contributions of household labour and volunteer work, and social and environmental costs and benefits.\n\nIn the decades after the Second World War, GDP growth functioned as a reasonable proxy for well-being when rebuilding economies and increasing production and consumption were the main priorities. However, since about 1950, which some call the Anthropocene era, ecological limits, inequality and declining social cohesion have restricted further improvements in well-being. At the same time, the rapid development of artificial intelligence promises fresh opportunities and challenges.\n\nDegrowth can work — here’s how science can help\n\nMeasuring and modelling what truly matters, not just market transactions, is now essential. Processes are under way to develop indicators that move beyond GDP. In May, the United Nations secretary-general António Guterres appointed a High-Level Expert Group to develop such measures, with a focus on balancing economic, social and environmental dimensions of well-being. This initiative builds on the 2015 Sustainable Development Goals (SDGs): target 19 of SDG17 commits governments to adopt beyond-GDP metrics by 2030.\n\nYet progress remains slow. Overcoming decades of structures built around GDP is difficult. Nonetheless, several governments, including those of New Zealand, Scotland, Wales and Bhutan, have experimented with alternatives to GDP1 (see also go.nature.com/3ktuvhv). Others should follow suit, but it will be a steep climb.\n\nShifting all societies from a narrow focus on GDP growth to a comprehensive understanding of the multiple factors that support well-being and prosperity, and of how these factors interact over space and time, demands consensus on another approach2. Over the past seven decades, researchers and institutions have proposed hundreds of alternatives to GDP.\n\nParadoxically, this proliferation has helped GDP to keep its privileged status, by creating the impression that there is little agreement on what sustainable and inclusive well-being means or how to measure it. In fact, there is much that these approaches do agree on.\n\nHere, we identify areas of common ground and propose four ways forward: universally adopting the goal of sustainable and inclusive well-being; establishing agreed metrics to evaluate progress towards this goal; developing models that incorporate the drivers and dynamics of well-being; and addressing institutionalized societal ‘addictions’ that reinforce unsustainable behaviours.\n\nEmbrace sustainable and inclusive well-being\n\nThe concept of sustainable and inclusive well-being — encompassing the well-being of all people and of the ecosystems that sustain life — is emerging as a widely accepted overarching policy goal that can provide common ground for beyond-GDP metrics, models and policies.\n\nBy assigning a central role to natural ecosystems and planetary boundaries, the concept acknowledges that human prosperity depends on healthy ecological systems. Respecting ecological limits by constraining the material scale of the economy is therefore a precondition for lasting well-being. It also demands that human societies prevent significant harm to other species, protect the rights of future generations and guarantee that all people today have access to essential resources, services and participatory forms of decision-making.\n\nMarket workers in Kenya. Employment is a core factor in many indicators of well-being.Credit: Elen Marlen/Getty\n\nA 2009 report on the measurement of economic performance and social progress, chaired by economist Joseph Stiglitz, laid the groundwork for moving beyond GDP3. Since then, international bodies, including the UN, the European Commission and the Organisation for Economic Co-operation and Development (OECD), have progressively adopted this conceptual foundation. Full international enforcement should follow; however, this might depend on a more-receptive US administration and stronger demand from civil society.\n\nAgree on well-being indicators\n\nConverging on an approach to evaluating sustainable and inclusive well-being is important if policymakers and organizations such as the UN are to embed these measures into official reporting and budgetary processes. Studies suggest that this is possible.\n\nAlthough more than 200 beyond-GDP indicators have been proposed, they share many similarities. These indicators often use different terminology to describe contributors to sustainable and inclusive well-being4. For example, ‘health’ might refer to mental health, physical health, health care, child welfare or any of more than 400 variants. Semantic modelling of the components of each indicator, which looks at the similarity between them, nevertheless reveals a high degree of agreement5. Nineteen key components capture a large proportion of the similarity (see ‘Well-being components’).\n\nWell-being components These 19 core factors are common to most beyond-GDP indicators5. Human Life satisfaction Health Life expectancy at birth Education Social Crime Civic engagement Governance Income equality Gender equality Built Housing Infrastructure Financial security Employment Per capita consumption Business health Natural Natural capital Water quality Air quality Greenhouse-gas emissions\n\nResearchers and policymakers, led by an international convening body such as the UN, should now establish a core set of around 20 components to serve as the backbone of national statistical reporting and UN frameworks. The UN High-Level Expert Group and the ongoing update of the SDGs are already advancing the agenda. The expert group has committed to an inclusive process that invites contributions from all stakeholders.\n\nInterested parties are encouraged to submit ideas and insights to help strengthen the emerging global consensus (see go.nature.com/4gcebvr). This month, the expert group launched an online consultation about its progress, and is expected to present its recommendations in the first half of 2026, which falls within the 80th session of the UN General Assembly. After this, intergovernmental processes will consider their recommendations.\n\nTo build a better world, stop chasing economic growth\n\nOther efforts include the UN System of Environmental Economic Accounting and the UN System of National Accounts 2025 initiative, which are revising economic accounts to include more well-being components. The 2024 UN Pact for the Future and recommendations from the secretary-general’s Our Common Agenda report call for measures of progress that complement GDP. But these efforts need help from researchers and the consensus recommendations of the High-Level Expert Group.\n\nThe UN can also play a central part in strengthening institutional capacity and securing stable funding to support the regular production of national estimates. Advances in citizen science, social-media analytics and remote sensing offer opportunities to reduce costs and improve data reliability. The world is awash with big data, so directing even a fraction of these resources towards measuring sustainable and inclusive well-being would enhance global monitoring and policy effectiveness.\n\nDevelop dynamic models that go beyond GDP\n\nGDP has retained its dominance partly because it is embedded in the models that underpin national accounts and policy analyses. For example, the input–output model developed by economist Wassily Leontief6 tracks monetary flows across sectors and into ‘final demand’, defined as GDP.\n\nWhy we need to measure people’s well-being — lessons from a global survey\n\nMainstream macroeconomic models also place growth at the centre of policy evaluation. For example, standard computable general equilibrium models assume a high degree of substitutability among factors of production, implying that labour or technology can largely replace natural resources. They neglect environmental limits and exclude well-being, equity and ecological integrity. Most importantly, they are optimization models that are intended to maximize a single objective — GDP — rather than being designed to evaluate policies against multiple goals, as is required for sustainable and inclusive well-being.\n\nNew models are needed. These must be dynamic, nonlinear and represent the economy as a subsystem of society embedded in the biosphere. Such models must be able to compare resource use and pollution to environmental limits, and social outcomes to the thresholds required to meet human needs7. They must track both stocks (natural, human, social and built capital) and flows (including monetary transactions, ecosystem services and social benefits) and capture their interactions, including feedbacks from transgressing environmental limits. Ecological macroeconomic models, rooted in the field of ecological economics, are one promising approach8.\n\nYoung people at a cultural arts centre in Kibera, an informal settlement in Nairobi, perform a traditional African dance.Credit: Eva-Maria Krafczyk/dpa/Alamy\n\nEcological macroeconomic models that incorporate measures of sustainable and inclusive well-being can be used to simulate trade-offs, synergies and pathways towards sustainable prosperity, rather than the impossible pursuit of perpetual GDP growth. Such models must recognize that nature cannot be replaced indefinitely, and must limit the decoupling of economic activity and resource use to rates that are realistic. A robust representation of how resources, wealth and income are distributed within and between countries is also essential.\n\nVersions of such models exist9–12 (see also go.nature.com/3wmtrjd). These and other efforts are advancing in close collaboration with attempts to build consensus around well-being indicators. This collaboration, which was mostly absent in the past, is essential for moving beyond GDP. Projects such as MAPS, WISE Horizons and MERGE, all funded by the European Union, are actively working towards this integration.\n\nTreat societal addictions\n\nDespite growing recognition that development must shift towards sustainable and inclusive well-being, groups with vested interests in the status quo hamper progress. These include the fossil-fuel industry, the financial sector and entrenched economic and political elites. Their influence is substantial, and they deploy it to resist change.\n\nWhy the green-technology race might not save the planet\n\nThe fossil-fuel sector, for example, invests heavily in lobbying, campaign financing and the spread of misinformation, while imposing vast unaccounted external costs on society, such as those of climate change. The International Monetary Fund (IMF) estimated that global fossil-fuel subsidies reached US$7 trillion in 2022 (see go.nature.com/3tuq6qk). One analysis suggests that, for each dollar invested in political campaigns, oil companies receive returns of at least $400 in subsidies and tax benefits13.\n\nExposing these relationships can influence policymakers, but transparency alone cannot dismantle entrenched systems. Unless the reinforcing mechanisms that sustain these interests are disrupted, their influence will persist. The IMF projects that, unless there is intervention, fossil-fuel subsidies will continue to rise until 2030 — delaying the energy transition and deepening climate risks. Political actions, such as efforts by the Trump administration to slow the deployment of renewable energy, underscore how institutional power can reinforce dependency.\n\nIn effect, societies are ‘addicted’ to the current growth-driven system14. Overcoming this addiction requires developing strategies that challenge and dislodge the structures that perpetuate harmful incentives. Addiction therapy shows that directly confronting individuals with the harms they cause to themselves and others rarely motivates change. More often, such confrontations provoke denial and entrenchment. Yet this approach characterizes many strategies aimed at shifting societal behaviour. Simply emphasizing dire long-term consequences without offering positive alternatives can make change even harder.\n\nFor some people, the therapeutic approach of motivational interviewing has proved effective at prompting change15. Engaging individuals in a non-judgemental dialogue often helps them to articulate a positive vision of a better life, which motivates them to make the difficult changes needed to overcome their addiction. Applying this analogy at the societal level means engaging communities, nations and the world in deliberating and envisioning alternative futures, then building consensus around preferred pathways14.\n\nExtending the Sustainable Development Goals to 2050 — a road map\n\nAchieving the transition to a world in which vested interests no longer exert undue influence over political decisions will also require a critical mass of citizens. This might take the form of a ‘movement of movements’: an alliance of initiatives united by a shared vision of sustainable and inclusive well-being. Constructing such a coalition demands clarity about its overarching goals and widely accepted metrics, models and policies.\n\nThe Well-being Economy Alliance (WEAll), for example, seeks to connect hundreds of organizations and millions of individuals who already share the ambition of building economies centred on well-being rather than on growth. A movement of movements of this scale could complement a broader global alliance involving key international organizations, including the UN, OECD and EU, alongside leading experts, to coordinate efforts and take the decisive step beyond GDP.\n\nCitizens already know what matters and understand that GDP does not measure it. Researchers know that current models fail to capture the system’s complexity or dynamics. The task now is to embed agreed well-being metrics and models into practice in statistical offices, policy institutes and ministries, supported by international agencies and the many civil-society movements already working for the shared goal of sustainable and inclusive well-being.\n\nOvercoming the world’s addiction to GDP will require collective commitment. The current global ‘polycrisis’ might create a rare window of opportunity for transformative change, and the alternatives outlined here are ready to step forward.",
      "category": "economy",
      "source": "Nature.com",
      "link": "https://www.nature.com/articles/d41586-025-03721-1",
      "date": "2025-11-18"
    },
    {
      "id": "825f",
      "title": "Google DeepMind won a Nobel prize for AI: can it produce the next big breakthrough?",
      "description": "The company was created to use AI for world- changing science — and achieved that with AlphaFold. But the advent of large language models raises deep questions about the future of DeepMind.",
      "body": "No one could accuse Demis Hassabis of dreaming small.\n\nIn 2016, the company he co-founded, DeepMind, shocked the world when an artificial intelligence model it created beat the best human player of the strategy game Go. Then Hassabis set his sights even higher: in 2019, he told colleagues that his goal was to win Nobel prizes with the company’s AI tools.\n\nChemistry Nobel goes to developers of AlphaFold AI that predicts protein structures\n\nIt took only five years for Hassabis and DeepMind’s John Jumper to do so, collecting a share of the 2024 Nobel Prize in Chemistry for creating AlphaFold, the AI that revolutionized the prediction of protein structures.\n\nAlphaFold is just one in a string of science successes that DeepMind has achieved over the past decade. When he co-founded the company in 2010, Hassabis, a neuroscientist and game developer, says his aim was to make “a world-class scientific research lab, but in industry”. In that quest, the company sought to apply the scientific method to the development of AI, and to do so ethically and responsibly by anticipating risks and reducing potential harms. Establishing an AI ethics board was a condition of the firm’s agreement to be acquired by Google in 2014 for around US$400 million, according to media reports.\n\nNow Google DeepMind is trying to replicate the success of AlphaFold in other fields of science. “We’re applying AI to nearly every other scientific discipline now,” says Hassabis.\n\nDemis Hassabis co-founded DeepMind in 2010.Credit: Antonio Olmos/Guardian/eyevine\n\nBut the climate for this marriage of science and industry has changed drastically since the release of ChatGPT in 2022 — an event that Hassabis calls a “wake-up moment”. The arrival of chatbots and the large language models (LLMs) that power them led to an explosion in AI usage across society, as well as a scramble by a growing number of well-funded competitors to achieve human-level artificial general intelligence (AGI).\n\nGoogle DeepMind is now racing to release commercial products — including iterations of the firm’s Gemini LLMs — almost weekly, while continuing its machine-learning research and producing science-specific models. The acceleration has made doing responsible AI harder, and some staff are unhappy with the firm’s more commercial outlook, say several former employees.\n\nAll of this raises questions about where DeepMind is headed, and whether it can achieve blockbuster successes in other fields of science.\n\nNobel bound\n\nAt Google DeepMind’s slick headquarters in London’s King’s Cross technology hub, gleaming geometric sculptures and the smell of espresso hang in the reception hall. Time is so precious that staff members — thought to number between 500 and 1,000 worldwide — can pick up a scooter to race the few hundred metres from one office to another.\n\nIt’s a far cry from the humble origins of the company, which sought to build general AI systems by melding ideas from neuroscience and machine learning. “They were absolutely just super geniuses,” says Joanna Bryson, a computer scientist and researcher in AI ethics at the Hertie School in Berlin. “They were these 12 guys that everybody wanted.”\n\nThe laboratory pioneered the deep-learning AI technique, which uses simulated neurons to learn associations in data after studying real-world examples, as well as reinforcement learning, in which a model learns by trial, error and reward. After applying these to teach models how to play arcade games1 in 2015 and master the ancient game of Go2 in 2016, DeepMind turned its sights to its first scientific problem — predicting the 3D structure of proteins3 from their constituent amino acids.\n\nA member of the AlphaFold team examines a prediction of a protein structure.Credit: Alecsandra Dragoi for Nature\n\nHassabis first came across the puzzle of protein structure as an undergraduate at the University of Cambridge, UK, in the 1990s and noted it as being a problem that AI might one day help to solve. AI learning techniques require a database of examples as well as clear metrics of success that guide the model’s progress. Thanks to a long-standing database of known structures and an established competition that judged the accuracy of the predictions, proteins had both.\n\nProtein folding ticked a crucial box for Hassabis: it is a ‘root node’ problem that, once solved, opens up branches of downstream research and applications. Those kinds of problem “are worth spending five years or ten years on, and loads of computers and researchers”, he says.\n\nWhat’s next for AlphaFold and the AI protein-folding revolution\n\nDeepMind released its first iteration of AlphaFold in 2018, and by 2020, its performance far outstripped that of tools from any other team. Today, a spin-off from DeepMind, Isomorphic Labs, is seeking to use AlphaFold in drug discovery. And DeepMind’s AlphaFold database of more than 200 million protein-structure predictions has been used in a range of research efforts, from improving bee immunity to disease in the face of global population declines to screening for antiparasitic compounds to treat Chagas disease, a potentially life-threatening parasitic infection4.\n\nScience is not just a source of problems to solve; the firm tries to approach all of its AI development in a scientific way, says Pushmeet Kohli, who leads the company’s science efforts. Researchers tend to go back to first principles for each problem and try fresh techniques, he says. Staff members at many other AI firms are more like engineers, applying ingenuity but not doing basic discovery, says Jonathan Godwin, chief executive of the AI firm Orbital Materials in London, who was a researcher at Google DeepMind until the end of 2022.\n\nJohn Jumper and Pushmeet Kohli speak to researcher Olaf Ronneberger in the DeepMind offices.Credit: Alecsandra Dragoi for Nature\n\nBut replicating the success of AlphaFold will be tough: “Not many scientific endeavours work like that,” says Godwin.\n\nUnlocking the genome\n\nGoogle DeepMind is throwing its resources at several problems for which it thinks AI could speed development, and which could have “transformative impact”, says Kohli. These include weather forecasting5 and nuclear fusion, which has the potential to become a clean, abundant energy source. The company picks projects through a strict selection process, but individual researchers can choose which to work on and how to tackle a problem, he says. AI models that work on such problems often require specialized data and researchers to program knowledge into them.\n\nOne project that shows promise, says Kohli, is AlphaGenome, which launched in June as an attempt to decipher long stretches of human non-coding DNA and predict their possible functions6. But the challenge is harder than for AlphaFold, because each sequence yields multiple valid functions.\n\nMaterials science is another area in which the company hopes that AI could be revolutionary. Materials are hard to model because the complex interactions of atomic nuclei and electrons can only be approximated. Learning from a database of simulated structures, DeepMind developed its GNoME model, which in 2023 predicted 400,000 potential new substances7. Now, Kohli says, the team is using machine learning to develop better ways to simulate electron behaviour, ones that are learnt from example interactions rather than by relying on the principles of physics. The end goal is to predict materials with specific properties, such as magnetism or superconductivity, he says. “We want to see the era where AI can basically design any material with any sort of magical property that you want, if it is possible,” he says.\n\nJohn Jumper and Pushmeet Kohli in the headquarters building.Credit: Alecsandra Dragoi for Nature\n\nAI models have a variety of known safety issues, from the risk of being used to create bioweapons to the perpetuation of racial and gender-based biases, and these come to the fore when releasing models into the world. Google DeepMind has a dedicated committee on responsibility and safety that works across the company and is consulted at each major stage of development, says Anna Koivuniemi, who runs its ‘impact accelerator’, an effort to scour society for areas in which AI could make a difference. Committee members stress-test the idea to see what could go wrong, including by consulting externally. “We take it very, very seriously,” she says.\n\nAnother advantage the firm has is that its researchers are pursuing the kind of AI that the world ultimately wants, says Godwin. “People don’t really want random videos of themselves being generated and put on a social-media network; they want limitless energy or diseases being cured,” he says.\n\nBut DeepMind now has company in the quest to use AI for science. Some firms that started out making LLMs seem to be coming around to Hassabis’ vision of AI for science. In the past two months, both OpenAI and the Paris-based AI firm Mistral have created teams dedicated to scientific discovery.\n\nCompany concerns\n\nFor AI companies and researchers, OpenAI’s 2022 release of ChatGPT changed everything. Its success was “pretty surprising to everyone”, says Hassabis.\n\nFollowing that watershed moment, in 2023 DeepMind merged with Google Brain, Google’s other major AI research team, to centralize its AI expertise and compete with other companies in rolling out LLMs. The newly formed Google DeepMind launched Google’s first commercial LLM, Gemini, in December 2023. The acceleration of AI development means the firm now has a commercial imperative, as well as a research one, says Hassabis.\n\nAI tools are designing entirely new proteins that could transform medicine\n\nOn the one hand, that means more investment, computing resources and intensity of work. On the other hand, it makes it harder to focus on doing research for its own sake, foreseeing the impacts of technologies and deploying them responsibly, he says. “That’s something that is harder when you’re in this commercial kind of flywheel,” he adds.\n\nThe shift means more competition for talent and the company has been forced to take on more of an engineering-focused culture to stay at the cutting edge, says Godwin. However, Google DeepMind researchers working on AI for science face fewer commercial demands than do their colleagues who work on other projects, he says.\n\nThere is some evidence that the increased competition has also changed the company’s openness towards publishing its work. Nicholas Carlini, an AI safety researcher who joined Google DeepMind from Google Brain during the merger, left earlier this year, claiming in an open letter that it had become harder to publish at the company. The share of papers co-authored by researchers listed as being at DeepMind, Google Brain or Google DeepMind, for example, has fallen at three top AI conferences — NeurIPS, ICLR and ICML — from 10.5% at its peak in 2018 to 4.5% in 2024, although the overall number of papers from these researchers has risen sharply over these years (see ‘DeepMind’s research output’).\n\nSource: Nature analysis\n\nSome staff members also objected to Google DeepMind’s decision, in February, to drop from its ‘AI principles’ its commitment not to apply AI to surveillance or weapons.\n\nIn April, the Financial Times reported that around 300 UK staff members were making moves to unionize, in protest at the company’s stance on military involvement.\n\n“The updates to our AI Principles aren’t a wholesale change,” a Google DeepMind spokesperson told Nature, “but rather an opportunity for deeper engagement. Our core commitment — to pursue AI where benefits substantially outweigh the risks — remains the same.” The spokesperson also said that the company regularly updates policies “to preserve the ability for our teams to publish and contribute to the broader research ecosystem”. The company calculates that its share of papers accepted at top AI conferences in 2024 was about the same as its long-term average; this calculation tracks yearly publications by current Google DeepMind staff members.\n\nLike other AI companies, Google DeepMind is pursuing AGI — a somewhat vague term for a system that is resourceful enough to excel at any cognitive task. Many companies that specialize in LLMs are betting that AGI can be reached by scaling up these models, increasing the data and computing power available until they develop skills general enough to tackle any task.\n\nBut for that, Hassabis says, fresh conceptual breakthroughs in AI techniques will probably be needed.\n\nIn that regard, the company’s wide research base could bear fruit, say some researchers. The firm has “intellectual diversity there that I don’t see in the other companies”, says Gary Marcus, a neuroscientist at New York University. “I’ve always thought they have a better chance of actually getting to AGI than the other companies,” which are more focused on LLMs.\n\nWendy Hall, a computer scientist at the University of Southampton, UK, says there’s another key difference between DeepMind and other companies pursuing AGI. Hassabis “understands the boundaries of what they’re doing” and considers what it might mean for humanity to reach AGI, she says.\n\nHassabis says he feels a duty to demonstrate a responsible scientific approach, in contrast to Silicon Valley’s “move fast and break things” method. Despite the pressures, Google DeepMind has a chance to do things better than other firms, says Bryson. “They’re in Europe, they have that bit of distance. And they were never in it only for the money,” she says. “But I don’t know if it’s enough.”",
      "category": "technology",
      "source": "Nature.com",
      "link": "https://www.nature.com/articles/d41586-025-03713-1",
      "date": "2025-11-18"
    },
    {
      "id": "c404",
      "title": "Trump says US will sell F-35 stealth jets to Saudi Arabia",
      "description": "President Donald Trump said Monday (Nov 17) the United States would sell F-35 stealth fighters to Saudi Arabia, a day before Saudi Crown Prince Mohammed bin Salman visits the White House for talks.\"We will be doing that. We will be selling F-35s,\" Trump told …",
      "body": "WASHINGTON: United States President Donald Trump will roll out the red carpet for Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman, on Tuesday (Nov 18) for a visit expected to advance the sale of F-35 fighter jets and a host of business deals with the kingdom.\n\nIt will be the first trip by bin Salman, widely known as MBS, to the US since the 2018 killing of Saudi critic Jamal Khashoggi by Saudi agents in Istanbul, which triggered global outrage.\n\nUS intelligence concluded that MBS approved the capture or killing of Khashoggi, a prominent critic. The crown prince denied ordering the operation but acknowledged responsibility as the kingdom's de facto ruler.\n\nThe warm welcome he will receive in Washington is the latest sign that relations have recovered from the deep strain caused by Khashoggi's murder.\n\nDuring a day of White House diplomacy, MBS will hold talks with Trump in the Oval Office, have lunch in the Cabinet Room and attend a formal black-tie dinner in the evening.\n\nTrump hopes to cash in on a US$600 billion Saudi investment pledge made during his visit to the kingdom in May. A senior White House official told Reuters that US-Saudi deals on technology, manufacturing, defence and more are expected.\n\nTrump told reporters on Monday that \"We'll be selling\" F-35s to Saudi Arabia, which has requested to buy 48 of the advanced aircraft.\n\nThis would be the first US sale of the fighter jets to Saudi Arabia and mark a significant policy shift. The deal could alter the military balance in the Middle East and test Washington's definition of maintaining what the US has termed Israel's \"qualitative military edge\".\n\nUntil now, Israel has been the only country in the Middle East to have the F-35.\n\nBeyond military equipment, the Saudi leader is seeking security guarantees, access to artificial intelligence technology and progress on a deal on a civilian nuclear programme.\n\n\"The Saudis will be spending a lot of money tomorrow on the US,\" a senior White House official told Reuters on Monday.",
      "category": "politics",
      "source": "CNA",
      "link": "https://www.channelnewsasia.com/world/trump-says-us-will-sell-f-35-stealth-jets-saudi-arabia-5473486",
      "date": "2025-11-18"
    }
  ]
}